[
  {
    "name": "Maputo",
    "city": "Maputo",
    "type": "culture",
    "description": "The vibrant capital city is known for its rich history, stunning architecture, and lively markets. Visitors can explore the renowned Maputo Central Market and enjoy the local cuisine.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Bazaruto Archipelago",
    "city": "Vilanculos",
    "type": "nature",
    "description": "A stunning group of islands known for their crystal-clear waters, white sandy beaches, and diverse marine life. It's a paradise for snorkeling and diving enthusiasts.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Gorongosa National Park",
    "city": "Sofala Province",
    "type": "nature",
    "description": "This iconic national park is a biodiversity hotspot, home to a variety of wildlife and beautiful landscapes. It's an excellent destination for wildlife safaris and eco-tourism.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Inhaca Island",
    "city": "Maputo",
    "type": "nature",
    "description": "A tropical island known for its beautiful beaches, coral reefs, and unique biodiversity. It's perfect for relaxation, snorkeling, and exploring nature.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Tofo Beach",
    "city": "Tofo",
    "type": "nature",
    "description": "Famous for its stunning beaches and vibrant marine life, Tofo Beach is a popular destination for surfers and divers. The nearby reefs are home to whale sharks and manta rays.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Quirimbas National Park",
    "city": "Ibo Island",
    "type": "nature",
    "description": "A beautiful national park consisting of islands and marine ecosystems. It's known for its pristine beaches, coral reefs, and rich cultural heritage.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Maputo Railway Station",
    "city": "Maputo",
    "type": "landmark",
    "description": "An architectural gem, this historic railway station features stunning colonial design and is a key part of the city's transportation history.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Inhambane",
    "city": "Inhambane",
    "type": "culture",
    "description": "A charming coastal town with a rich cultural heritage, known for its historic buildings and vibrant markets. The nearby beaches are perfect for relaxation and water sports.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Ponta do Ouro",
    "city": "Ponta do Ouro",
    "type": "nature",
    "description": "A stunning beach destination known for its clear waters, excellent diving spots, and vibrant nightlife. It's a popular spot for dolphin watching and marine adventures.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Cabo Delgado",
    "city": "Cabo Delgado Province",
    "type": "nature",
    "description": "This region offers stunning landscapes, rich culture, and beautiful beaches. It's less touristy and provides an authentic experience of Mozambique's natural beauty.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "The Island of Mozambique",
    "city": "Ibo",
    "type": "culture",
    "description": "A UNESCO World Heritage site, known for its rich history and colonial architecture. It's a fascinating place to explore Mozambique's cultural heritage.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Lagoa de S. Afonso",
    "city": "Benguerra Island",
    "type": "nature",
    "description": "A serene lagoon surrounded by stunning landscapes, perfect for birdwatching and enjoying the tranquil environment. It's a hidden gem for nature lovers.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Chimanimani Mountains",
    "city": "Chimanimani",
    "type": "nature",
    "description": "A breathtaking mountain range offering hiking trails, stunning views, and unique rock formations. It's a great spot for adventure enthusiasts.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Benguerra Island",
    "city": "Benguerra",
    "type": "nature",
    "description": "Known for its stunning beaches and luxury resorts, this island is perfect for relaxation and water sports in a tranquil setting.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Tete",
    "city": "Tete",
    "type": "culture",
    "description": "A historical city with rich cultural significance, known for its diverse communities and vibrant markets. It's a great place to experience local life.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Beira",
    "city": "Beira",
    "type": "culture",
    "description": "Mozambique's second-largest city, known for its colonial architecture and bustling port. It's a gateway to explore the central region of Mozambique.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Gile Nature Reserve",
    "city": "Nampula Province",
    "type": "nature",
    "description": "A unique reserve that offers diverse wildlife and beautiful landscapes. It's a lesser-known destination for eco-tourism and nature exploration.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Macaneta Beach",
    "city": "Maputo",
    "type": "nature",
    "description": "A beautiful beach located near Maputo, known for its sandy shores and vibrant atmosphere. It's a perfect getaway for locals and tourists alike.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Cape of Good Hope",
    "city": "Cabo de Santa Maria",
    "type": "nature",
    "description": "A stunning coastal area offering breathtaking views and rich marine biodiversity. It's a great spot for nature lovers and photographers.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Sussundenga",
    "city": "Manica Province",
    "type": "culture",
    "description": "A small town known for its rich cultural heritage and beautiful landscapes. It's a great place to experience local traditions and customs.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Mocambique Island",
    "city": "Mocambique",
    "type": "culture",
    "description": "A historic island with a rich history, known for its colonial architecture and cultural influences. It's a great place to explore Mozambique's past.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Zinave National Park",
    "city": "Gaza Province",
    "type": "nature",
    "description": "A remote national park known for its diverse wildlife and beautiful landscapes. It's an ideal spot for adventurous safaris and nature exploration.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Nampula",
    "city": "Nampula",
    "type": "culture",
    "description": "A vibrant city known for its cultural diversity and bustling markets. Visitors can explore local crafts and experience the rich traditions of the region.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Cahora Bassa Dam",
    "city": "Tete Province",
    "type": "landmark",
    "description": "One of the largest hydroelectric dams in Africa, offering stunning views and recreational activities such as fishing and boating.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Lichinga",
    "city": "Niassa Province",
    "type": "culture",
    "description": "A charming town known for its scenic landscapes and rich cultural heritage. It's a great place to experience local traditions and hospitality.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Chongoene Beach",
    "city": "Chongoene",
    "type": "nature",
    "description": "A hidden gem with pristine beaches and turquoise waters, perfect for relaxation and enjoying the sun. It's less crowded and offers a serene atmosphere.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Vilanculos Coastal Wildlife Sanctuary",
    "city": "Vilanculos",
    "type": "nature",
    "description": "A protected area known for its rich biodiversity and stunning coastal landscapes. It's a great place for eco-tourism and exploring nature.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Pemba",
    "city": "Pemba",
    "type": "nature",
    "description": "A beautiful coastal city known for its stunning beaches and vibrant coral reefs. It's a popular spot for diving and exploring marine life.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Sandy Island",
    "city": "Sandy Island",
    "type": "nature",
    "description": "A small, secluded island perfect for a peaceful getaway. It offers beautiful beaches and excellent snorkeling opportunities.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Tropical Island Resort",
    "city": "Quirimbas",
    "type": "entertainment",
    "description": "A luxurious resort offering a unique blend of relaxation and adventure. Visitors can enjoy spa treatments, water sports, and beautiful sunset views.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Bazaruto National Park",
    "city": "Bazaruto",
    "type": "nature",
    "description": "A unique marine park consisting of several islands known for their stunning beauty and rich marine biodiversity. It's a paradise for nature lovers and adventure seekers.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Chimanimani National Park",
    "city": "Chimanimani",
    "type": "nature",
    "description": "Known for its rugged mountains and diverse flora and fauna, it's a fantastic spot for hiking, birdwatching, and exploring nature.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Cabo de São Sebastião",
    "city": "Nampula",
    "type": "landmark",
    "description": "A historic lighthouse that offers stunning views of the coastline and surrounding areas. It's a great photo opportunity and a glimpse into maritime history.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Ponta Malongane",
    "city": "Ponta Malongane",
    "type": "nature",
    "description": "A secluded beach paradise known for its clear waters and beautiful scenery. It's ideal for beach lovers and those seeking tranquility.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Cascata do Pungwe",
    "city": "Gorongosa",
    "type": "nature",
    "description": "A stunning waterfall nestled in the Gorongosa National Park, offering breathtaking views and a peaceful atmosphere. It's a great spot for nature photographers.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Kanyaka",
    "city": "Tete Province",
    "type": "culture",
    "description": "A traditional village showcasing local culture and customs. Visitors can engage with the community and experience authentic Mozambican hospitality.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Bela Vista",
    "city": "Maputo",
    "type": "entertainment",
    "description": "A popular entertainment complex featuring restaurants, bars, and live music. It's a great place to experience the local nightlife and cuisine.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Tropical Mozambique",
    "city": "Inhambane",
    "type": "entertainment",
    "description": "A lively resort area offering a mix of relaxation and adventure, with water sports, restaurants, and vibrant nightlife.",
    "country": "Mozambique",
    "country_rank": 6
  },
  {
    "name": "Nacala",
    "city": "Nacala",
    "type": "culture",
    "description": "A coastal city with a rich history and beautiful beaches. It's less touristy and offers an authentic experience of Mozambican culture.",
    "country": "Mozambique",
    "country_rank": 6
  }
]
