[
  {
    "name": "Grand Palace",
    "city": "Bangkok",
    "type": "landmark",
    "description": "The Grand Palace is a spectacular complex of buildings that served as the official residence of the Kings of Siam. Its intricate architecture and stunning gardens showcase the grandeur of Thai history.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Wat Pho",
    "city": "Bangkok",
    "type": "culture",
    "description": "Home to the famous Reclining Buddha, Wat Pho is one of the oldest and largest temples in Bangkok. It is also renowned for its traditional Thai massage school.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Chatuchak Weekend Market",
    "city": "Bangkok",
    "type": "entertainment",
    "description": "Spanning over 35 acres, Chatuchak is one of the largest markets in the world, offering a vast array of goods from antiques to clothing. It's a vibrant place to experience local culture and cuisine.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Koh Phi Phi Islands",
    "city": "Krabi",
    "type": "nature",
    "description": "Famous for their stunning limestone cliffs and crystal-clear waters, the Phi Phi Islands are a paradise for snorkeling, diving, and beach lounging. The picturesque scenery is unforgettable.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Ayutthaya Historical Park",
    "city": "Ayutthaya",
    "type": "landmark",
    "description": "A UNESCO World Heritage Site, Ayutthaya is home to impressive ruins of temples and palaces that date back to the 14th century. It's a glimpse into Thailand's rich historical past.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Erawan National Park",
    "city": "Kanchanaburi",
    "type": "nature",
    "description": "Known for its stunning seven-tiered waterfalls, Erawan National Park is perfect for hiking and swimming. The lush jungle surroundings enhance the beauty of this natural wonder.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Doi Suthep",
    "city": "Chiang Mai",
    "type": "culture",
    "description": "Doi Suthep is a sacred mountain with a stunning temple perched at its summit. The temple offers breathtaking views of Chiang Mai and is an important pilgrimage site for locals.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Sukhothai Historical Park",
    "city": "Sukhothai",
    "type": "landmark",
    "description": "Another UNESCO World Heritage Site, Sukhothai Historical Park features well-preserved ruins of temples from the 13th century, showcasing the beginnings of Thai civilization.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Railay Beach",
    "city": "Krabi",
    "type": "nature",
    "description": "Accessible only by boat, Railay Beach is surrounded by towering limestone cliffs and offers some of the best rock climbing in the world. Its serene beaches are perfect for relaxation.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Chiang Mai Night Bazaar",
    "city": "Chiang Mai",
    "type": "entertainment",
    "description": "The Night Bazaar in Chiang Mai is a bustling market offering a mix of local handicrafts, street food, and entertainment. It's a great place to experience the local vibe.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Lopburi Monkey Temple",
    "city": "Lopburi",
    "type": "culture",
    "description": "The Phra Prang Sam Yot temple is famous for its resident monkeys that roam freely. Visitors can enjoy the quirky interaction with these playful creatures.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Koh Samui",
    "city": "Koh Samui",
    "type": "nature",
    "description": "Koh Samui is an island known for its palm-fringed beaches, luxury resorts, and vibrant nightlife. It’s a popular destination for relaxation and adventure.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Kanchanaburi Bridge",
    "city": "Kanchanaburi",
    "type": "landmark",
    "description": "Also known as the Bridge on the River Kwai, this historical bridge is a solemn reminder of World War II history, surrounded by beautiful scenery.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Wat Rong Khun (White Temple)",
    "city": "Chiang Rai",
    "type": "culture",
    "description": "Designed by artist Chalermchai Kositpipat, the White Temple is a contemporary masterpiece with intricate designs and symbolism. Its dazzling white exterior is breathtaking.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Surin Islands",
    "city": "Phang Nga",
    "type": "nature",
    "description": "A lesser-known gem, the Surin Islands boast pristine beaches and vibrant coral reefs, making them ideal for snorkeling and diving. It's a tranquil escape from the crowds.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Koh Lanta",
    "city": "Krabi",
    "type": "nature",
    "description": "Koh Lanta is known for its laid-back atmosphere and beautiful beaches. It’s a perfect spot for families and those seeking a quieter beach experience.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Nakhon Si Thammarat",
    "city": "Nakhon Si Thammarat",
    "type": "culture",
    "description": "This town is rich in history and culture, featuring ancient temples and traditional crafts. It's less touristy, providing an authentic Thai experience.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Koh Tao",
    "city": "Koh Tao",
    "type": "nature",
    "description": "Known for its exceptional diving spots, Koh Tao is a small island with stunning underwater biodiversity. It’s a favorite for scuba enthusiasts.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Pattaya Floating Market",
    "city": "Pattaya",
    "type": "entertainment",
    "description": "A unique market built on water, the Pattaya Floating Market showcases Thai culture with food stalls, crafts, and performances. Visitors can enjoy boat rides and local delicacies.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Khao Sok National Park",
    "city": "Surat Thani",
    "type": "nature",
    "description": "Khao Sok is one of Thailand's oldest rainforests, offering incredible biodiversity and stunning limestone cliffs. Visitors can enjoy jungle treks and boat rides on Cheow Lan Lake.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Sukhothai Night Market",
    "city": "Sukhothai",
    "type": "entertainment",
    "description": "The night market in Sukhothai offers delicious local street food and handmade crafts. It's a great place to experience the local culture after sunset.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Sam Phan Bok",
    "city": "Ubon Ratchathani",
    "type": "nature",
    "description": "Known as the 'Grand Canyon of Thailand,' Sam Phan Bok features stunning rock formations and natural pools. It's an off-the-beaten-path destination perfect for photography.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Phang Nga Bay",
    "city": "Phang Nga",
    "type": "nature",
    "description": "Famous for its limestone karsts and emerald-green waters, Phang Nga Bay is a stunning natural wonder. Boat tours offer a chance to explore its hidden lagoons and caves.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Wat Phra That Doi Suthep",
    "city": "Chiang Mai",
    "type": "culture",
    "description": "This sacred temple offers panoramic views of Chiang Mai and is an important pilgrimage site. Its stunning golden chedi is a spiritual symbol for many Thai people.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Bangkok Art and Culture Centre",
    "city": "Bangkok",
    "type": "culture",
    "description": "A contemporary arts center showcasing local and international art, the Bangkok Art and Culture Centre is a hub for exhibitions, performances, and cultural events.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Koh Yao Islands",
    "city": "Phang Nga",
    "type": "nature",
    "description": "The Koh Yao Islands offer a peaceful retreat with unspoiled beaches and local charm. It's an ideal destination for those looking to escape the tourist crowds.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Wat Mahathat",
    "city": "Ayutthaya",
    "type": "culture",
    "description": "Famous for the Buddha head entwined in tree roots, Wat Mahathat is a symbol of Ayutthaya's rich history and architectural beauty.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Ban Rak Thai",
    "city": "Mae Hong Son",
    "type": "culture",
    "description": "This picturesque village is known for its Chinese heritage and beautiful tea plantations. Visitors can enjoy tranquil lakeside views and authentic Yunnan cuisine.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Doi Inthanon National Park",
    "city": "Chiang Mai",
    "type": "nature",
    "description": "Home to Thailand's highest peak, Doi Inthanon offers stunning waterfalls, hiking trails, and diverse flora and fauna. It's a paradise for nature enthusiasts.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Bamboo Island",
    "city": "Krabi",
    "type": "nature",
    "description": "A hidden gem, Bamboo Island features powdery white sand and crystal-clear waters, perfect for a day of relaxation and snorkeling.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Nong Khai Skywalk",
    "city": "Nong Khai",
    "type": "landmark",
    "description": "The Nong Khai Skywalk offers breathtaking views of the Mekong River and the surrounding landscape. It’s an impressive structure that combines art and nature.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Thung Teao Forest Natural Park",
    "city": "Krabi",
    "type": "nature",
    "description": "Known for its stunning blue pool, this park is a hidden gem where visitors can swim in the crystal-clear waters surrounded by lush forest.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Talad Rot Fai (Train Night Market)",
    "city": "Bangkok",
    "type": "entertainment",
    "description": "A vibrant night market with a retro vibe, Talad Rot Fai offers vintage goods, antiques, and a variety of food stalls. It’s a fun place for shopping and dining.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Wat Phra Kaew",
    "city": "Bangkok",
    "type": "culture",
    "description": "Located within the Grand Palace, Wat Phra Kaew is home to the Emerald Buddha, one of Thailand's most revered religious artifacts. The temple's intricate design captivates visitors.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Khao Lak",
    "city": "Phang Nga",
    "type": "nature",
    "description": "Known for its stunning beaches and proximity to national parks, Khao Lak is a serene destination perfect for relaxation and adventure activities like snorkeling and diving.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Baan Tawai Village",
    "city": "Chiang Mai",
    "type": "culture",
    "description": "Famous for its woodwork and handicrafts, Baan Tawai is a traditional artisan village where visitors can shop for unique souvenirs and observe craftsmen at work.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Sangkhla Buri",
    "city": "Kanchanaburi",
    "type": "culture",
    "description": "A quaint town near the border with Myanmar, Sangkhla Buri features a beautiful wooden bridge and a blend of cultures. It's a tranquil place to experience local life.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Koh Samet",
    "city": "Rayong",
    "type": "nature",
    "description": "Koh Samet is known for its beautiful beaches and vibrant nightlife. The island is a popular weekend getaway for locals and offers a laid-back atmosphere.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Huay Tung Tao Lake",
    "city": "Chiang Mai",
    "type": "nature",
    "description": "A serene spot for picnics and relaxation, Huay Tung Tao Lake offers stunning views of the mountains and is surrounded by traditional bamboo huts.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Pak Khlong Talat (Flower Market)",
    "city": "Bangkok",
    "type": "culture",
    "description": "Bangkok's largest flower market is a vibrant place filled with colorful blooms and fragrant flowers. It's a great spot for photography and experiencing local culture.",
    "country": "Thailand",
    "country_rank": 6
  },
  {
    "name": "Nakhon Ratchasima (Korat)",
    "city": "Nakhon Ratchasima",
    "type": "culture",
    "description": "Known for its historical significance and cultural heritage, Korat is home to ancient Khmer ruins and traditional festivals, offering a glimpse into Thailand's past.",
    "country": "Thailand",
    "country_rank": 6
  }
]
