[
  {
    "name": "Bikini Atoll",
    "city": "Bikini",
    "type": "nature",
    "description": "Famous for its role in nuclear testing, Bikini Atoll is now a stunning underwater paradise. It features shipwrecks and vibrant coral reefs, making it a prime destination for divers and snorkelers.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Majuro Atoll",
    "city": "Majuro",
    "type": "nature",
    "description": "The capital of the Marshall Islands, Majuro Atoll is a beautiful series of islands known for their clear lagoons and rich marine life. Visitors can enjoy water sports, local markets, and cultural experiences.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Laura Beach",
    "city": "Majuro",
    "type": "nature",
    "description": "A pristine beach located on the western side of Majuro Atoll, Laura Beach offers stunning views and a tranquil environment. It's a perfect spot for sunbathing, swimming, and enjoying the peaceful surroundings.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Mili Atoll",
    "city": "Mili",
    "type": "nature",
    "description": "Known for its remote beauty, Mili Atoll is a hidden gem featuring unspoiled beaches and crystal-clear waters. It's an ideal destination for those looking to escape the crowd and enjoy nature.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Arno Atoll",
    "city": "Arno",
    "type": "nature",
    "description": "This picturesque atoll is home to stunning lagoons and diverse marine life. Arno Atoll is less visited, allowing for a more secluded experience amidst breathtaking natural beauty.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Alele Museum",
    "city": "Majuro",
    "type": "culture",
    "description": "Alele Museum showcases the history and culture of the Marshall Islands through its extensive collection of artifacts and exhibits. It provides insights into the local way of life, traditions, and art.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Namu Atoll",
    "city": "Namu",
    "type": "nature",
    "description": "Namu Atoll is renowned for its stunning natural beauty and biodiversity. It offers visitors a chance to explore uninhabited islands and experience the tranquility of untouched nature.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Ebeye Island",
    "city": "Ebeye",
    "type": "culture",
    "description": "Ebeye is a vibrant community with a unique blend of culture and history. Visitors can experience local life, traditional cuisine, and colorful markets that reflect the spirit of the Marshallese people.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Rongelap Atoll",
    "city": "Rongelap",
    "type": "nature",
    "description": "Once a site of nuclear testing, Rongelap Atoll has transformed into a beautiful destination for ecotourism. The atoll is surrounded by pristine waters and offers opportunities for snorkeling and diving.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Kili Island",
    "city": "Kili",
    "type": "nature",
    "description": "Kili Island is a small, idyllic island known for its lush vegetation and sandy beaches. It is a peaceful retreat for those looking to connect with nature and enjoy the serenity of island life.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Nuclear Test Site",
    "city": "Bikini",
    "type": "landmark",
    "description": "The site of multiple nuclear tests, this landmark serves as a stark reminder of the islands' history. Guided tours provide insight into the impacts of these tests on the local environment and culture.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Jaluit Atoll",
    "city": "Jaluit",
    "type": "nature",
    "description": "A picturesque atoll featuring stunning lagoons and rich marine biodiversity, Jaluit is perfect for kayaking and exploring its many small islands. Its remote location makes it a hidden paradise.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "The Marshall Islands Resort",
    "city": "Majuro",
    "type": "entertainment",
    "description": "This resort offers a blend of relaxation and entertainment with its beachfront access and vibrant nightlife. Guests can enjoy dining, water activities, and local cultural events.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Mokil Atoll",
    "city": "Mokil",
    "type": "nature",
    "description": "Known for its stunning coral reefs and lagoons, Mokil Atoll is a hidden paradise for snorkeling and diving enthusiasts. The remoteness of the atoll offers a tranquil escape from modern life.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Ebon Atoll",
    "city": "Ebon",
    "type": "nature",
    "description": "Ebon Atoll is famous for its lush scenery and diverse wildlife. The atoll's natural beauty and seclusion make it a perfect spot for eco-tourism and cultural experiences.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Bokak Atoll",
    "city": "Bokak",
    "type": "nature",
    "description": "Bokak Atoll is one of the most remote atolls in the Marshall Islands, offering pristine beaches and untouched nature. It's an ideal destination for adventurous travelers seeking solitude.",
    "country": "Marshall Islands",
    "country_rank": 2
  },
  {
    "name": "Kwakwa Island",
    "city": "Kwakwa",
    "type": "nature",
    "description": "A lesser-known island, Kwakwa features beautiful sandy shores and rich marine life. It's an excellent spot for those looking to relax away from the more popular tourist areas.",
    "country": "Marshall Islands",
    "country_rank": 2
  }
]
