[
  {
    "name": "Acropolis of Athens",
    "city": "Athens",
    "type": "landmark",
    "description": "An ancient citadel located on a rocky outcrop above the city of Athens, it contains the remains of several historically significant buildings, the most famous being the Parthenon.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Santorini",
    "city": "Santorini",
    "type": "nature",
    "description": "Famous for its stunning sunsets, whitewashed buildings, and crystal-clear waters, Santorini is a volcanic island that offers breathtaking views and romantic getaways.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Meteora",
    "city": "Kalambaka",
    "type": "landmark",
    "description": "A UNESCO World Heritage Site, Meteora is known for its monasteries perched atop towering rock formations, offering both spiritual significance and stunning scenic views.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Navagio Beach",
    "city": "Zakynthos",
    "type": "nature",
    "description": "Also known as Shipwreck Beach, this picturesque cove is famous for its turquoise waters and the wreck of a smuggler's ship, surrounded by dramatic cliffs.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "The Palace of Knossos",
    "city": "Heraklion",
    "type": "culture",
    "description": "The largest Bronze Age archaeological site on Crete, the Palace of Knossos is linked to the legend of the Minotaur and showcases advanced Minoan civilization.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Delphi",
    "city": "Delphi",
    "type": "culture",
    "description": "Once considered the center of the world in ancient Greek mythology, Delphi is home to the Oracle and numerous archaeological treasures set against a stunning mountainous backdrop.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Mykonos",
    "city": "Mykonos",
    "type": "entertainment",
    "description": "Known for its vibrant nightlife, beautiful beaches, and charming old town, Mykonos is a popular destination for both relaxation and partying.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Thessaloniki's White Tower",
    "city": "Thessaloniki",
    "type": "landmark",
    "description": "This iconic landmark serves as a museum and offers panoramic views of the city, symbolizing Thessaloniki's rich history and cultural heritage.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Olympia",
    "city": "Olympia",
    "type": "culture",
    "description": "The site of the ancient Olympic Games, Olympia is a significant archaeological site with ruins of temples, gymnasiums, and the original Olympic Stadium.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Corfu Old Town",
    "city": "Corfu",
    "type": "culture",
    "description": "A UNESCO World Heritage Site, Corfu's Old Town features Venetian architecture, narrow cobblestone streets, and a rich history reflected in its many museums and churches.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Samaria Gorge",
    "city": "Chania",
    "type": "nature",
    "description": "One of the longest gorges in Europe, the Samaria Gorge is a stunning natural park offering breathtaking views and a challenging hiking experience through diverse landscapes.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kea Island",
    "city": "Kea",
    "type": "nature",
    "description": "A less-traveled gem, Kea is known for its beautiful hiking trails, picturesque villages, and pristine beaches, providing a more authentic Greek island experience.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Spinalonga Island",
    "city": "Elounda",
    "type": "culture",
    "description": "Once a leper colony, Spinalonga is now a fascinating historical site with ruins and haunting stories, set against the backdrop of beautiful waters.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Nafplio",
    "city": "Nafplio",
    "type": "culture",
    "description": "This charming coastal town is known for its beautiful architecture, historic fortifications, and romantic ambiance, often regarded as one of Greece's most picturesque towns.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Mount Olympus",
    "city": "Litochoro",
    "type": "nature",
    "description": "As the highest mountain in Greece and home to ancient mythology, Mount Olympus offers stunning landscapes, rich biodiversity, and hiking opportunities.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Hydra Island",
    "city": "Hydra",
    "type": "nature",
    "description": "Famous for its ban on cars, Hydra is a serene island with beautiful stone mansions, narrow streets, and crystal-clear waters, perfect for relaxation.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Parga",
    "city": "Parga",
    "type": "nature",
    "description": "A picturesque town nestled between hills and the Ionian Sea, Parga is known for its colorful houses, beautiful beaches, and vibrant nightlife.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Chalkida",
    "city": "Chalkida",
    "type": "culture",
    "description": "Located on the island of Euboea, Chalkida is famous for its unique tidal phenomenon and rich history, with ancient ruins and beautiful waterfront promenades.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kefalonia",
    "city": "Kefalonia",
    "type": "nature",
    "description": "Known for its stunning beaches and dramatic landscapes, Kefalonia is a perfect destination for nature lovers, offering opportunities for hiking, swimming, and exploring caves.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Tinos Island",
    "city": "Tinos",
    "type": "culture",
    "description": "Famous for its beautiful villages and traditional architecture, Tinos is known for its religious significance and the stunning Panagia Evangelistria Church.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Sifnos Island",
    "city": "Sifnos",
    "type": "culture",
    "description": "Sifnos is celebrated for its culinary traditions, charming villages, and beautiful beaches, making it a perfect destination for food lovers and cultural enthusiasts.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Zagori Villages",
    "city": "Zagori",
    "type": "nature",
    "description": "A region of stunning natural beauty, the Zagori villages are known for their traditional stone architecture, breathtaking landscapes, and beautiful hiking trails.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Cave of Melissani",
    "city": "Kefalonia",
    "type": "nature",
    "description": "This breathtaking underground lake is surrounded by stalactites and is illuminated by sunlight, creating a magical atmosphere that attracts visitors year-round.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Peleponnese",
    "city": "Peloponnese",
    "type": "culture",
    "description": "Rich in history and culture, the Peloponnese peninsula offers ancient ruins, beautiful beaches, and charming villages, making it a diverse destination.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Pindus Mountains",
    "city": "Pindus",
    "type": "nature",
    "description": "Known for their rugged beauty and biodiversity, the Pindus Mountains offer stunning landscapes and excellent opportunities for hiking and outdoor activities.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Chios Island",
    "city": "Chios",
    "type": "culture",
    "description": "Famous for its unique mastic villages and medieval architecture, Chios is steeped in history and offers beautiful landscapes and rich traditions.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Lefkada Island",
    "city": "Lefkada",
    "type": "nature",
    "description": "Known for its stunning beaches with turquoise waters and dramatic cliffs, Lefkada is a popular destination for water sports and relaxation.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Nisyros Island",
    "city": "Nisyros",
    "type": "nature",
    "description": "A volcanic island with unique geological features, Nisyros offers hot springs, stunning landscapes, and quaint villages for exploration.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Rethymno Old Town",
    "city": "Rethymno",
    "type": "culture",
    "description": "With its Venetian architecture and charming narrow streets, Rethymno's Old Town is a blend of history, culture, and beautiful seaside views.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Aegina Island",
    "city": "Aegina",
    "type": "nature",
    "description": "Known for its pistachios and beautiful beaches, Aegina Island is a short ferry ride from Athens, making it a great day-trip destination.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Nafpaktos",
    "city": "Nafpaktos",
    "type": "culture",
    "description": "A charming town with a picturesque harbor, Nafpaktos is known for its medieval castle and stunning views of the Gulf of Corinth.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kardamyli",
    "city": "Peloponnese",
    "type": "nature",
    "description": "A tranquil village in the Mani Peninsula, Kardamyli is surrounded by stunning scenery, traditional stone houses, and beautiful hiking trails.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kythira Island",
    "city": "Kythira",
    "type": "nature",
    "description": "Known for its unspoiled beaches and charming villages, Kythira is a hidden gem that offers a laid-back atmosphere and stunning natural beauty.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Dikteon Cave",
    "city": "Crete",
    "type": "nature",
    "description": "Legendary birthplace of Zeus, Dikteon Cave features impressive stalactites and stalagmites, along with a rich history that attracts many visitors.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Voyage to Greece",
    "city": "Aegian Sea",
    "type": "entertainment",
    "description": "A sailing adventure that offers exploration of lesser-known islands, stunning sunsets, and unique experiences throughout the Aegean Sea.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kalamata",
    "city": "Kalamata",
    "type": "culture",
    "description": "Famous for its olives and vibrant cultural scene, Kalamata is a bustling city with beautiful beaches and a rich history.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Samos Island",
    "city": "Samos",
    "type": "nature",
    "description": "Known for its lush landscapes, beautiful beaches, and ancient ruins, Samos is an excellent destination for nature lovers and history enthusiasts.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "The Monastery of Hosios Loukas",
    "city": "Distomo",
    "type": "culture",
    "description": "A UNESCO World Heritage Site, this stunning Byzantine monastery is known for its intricate architecture and beautiful mosaics.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Skopelos Island",
    "city": "Skopelos",
    "type": "nature",
    "description": "Renowned for its lush greenery and beautiful beaches, Skopelos is a tranquil island perfect for those seeking relaxation and natural beauty.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kalamaki Beach",
    "city": "Zante",
    "type": "nature",
    "description": "A beautiful sandy beach known for its clear waters and natural surroundings, Kalamaki Beach is also a nesting site for loggerhead turtles.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Mystras",
    "city": "Mystras",
    "type": "culture",
    "description": "An important Byzantine site, Mystras is known for its well-preserved churches and monasteries set against a stunning mountainous backdrop.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Nafplio Fortress",
    "city": "Nafplio",
    "type": "landmark",
    "description": "Perched above the town, this fortress offers stunning views and a glimpse into the history of the area, making it a must-visit site.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Arachova",
    "city": "Arachova",
    "type": "culture",
    "description": "Known for its vibrant nightlife and as a ski resort, Arachova also boasts beautiful architecture and proximity to Delphi.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Vikos Gorge",
    "city": "Zagori",
    "type": "nature",
    "description": "One of the deepest gorges in the world, Vikos Gorge offers breathtaking views and hiking opportunities in a stunning natural setting.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Karditsa",
    "city": "Karditsa",
    "type": "culture",
    "description": "An off-the-beaten-path destination, Karditsa is known for its friendly locals, beautiful parks, and rich agricultural traditions.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kea Island",
    "city": "Kea",
    "type": "nature",
    "description": "A tranquil island with beautiful hiking trails, scenic beaches, and charming villages, Kea offers an authentic Greek island experience.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Kastoria",
    "city": "Kastoria",
    "type": "culture",
    "description": "Famous for its picturesque lakeside setting and Byzantine churches, Kastoria is a charming town with a rich history.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Agios Nikolaos",
    "city": "Crete",
    "type": "nature",
    "description": "Known for its stunning lake and beautiful beaches, Agios Nikolaos is a charming town that offers both relaxation and cultural experiences.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Folegandros Island",
    "city": "Folegandros",
    "type": "nature",
    "description": "This untouched island is known for its dramatic cliffs, charming villages, and serene beaches, providing a perfect getaway from the crowds.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Methoni Castle",
    "city": "Methoni",
    "type": "landmark",
    "description": "A stunning medieval castle overlooking the sea, Methoni Castle is a historical landmark that offers a glimpse into the region's past.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Gythio",
    "city": "Gythio",
    "type": "culture",
    "description": "A picturesque coastal town with a rich maritime history, Gythio is known for its charming harbor and beautiful beaches.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Elafonissi Beach",
    "city": "Crete",
    "type": "nature",
    "description": "Famous for its pink sand and clear waters, Elafonissi Beach is a stunning natural paradise perfect for sunbathing and swimming.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Paleokastritsa",
    "city": "Corfu",
    "type": "nature",
    "description": "Known for its beautiful beaches and crystal-clear waters, Paleokastritsa is a popular destination for swimming, snorkeling, and exploring nearby monasteries.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Lindos",
    "city": "Rhodes",
    "type": "culture",
    "description": "A charming village featuring ancient ruins, beautiful beaches, and stunning views, Lindos is a perfect blend of history and natural beauty.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Lesvos Island",
    "city": "Lesvos",
    "type": "nature",
    "description": "Known for its beautiful landscapes, traditional villages, and rich history, Lesvos offers a more authentic Greek island experience.",
    "country": "Greece",
    "country_rank": 9
  },
  {
    "name": "Ancient Corinth",
    "city": "Corinth",
    "type": "culture",
    "description": "Home to significant ancient ruins, including the Temple of Apollo, Ancient Corinth offers a fascinating glimpse into Greece's classical past.",
    "country": "Greece",
    "country_rank": 9
  }
]
