[
  {
    "name": "Boiling Lake",
    "city": "Morne Trois Pitons National Park",
    "type": "nature",
    "description": "One of the largest hot springs in the world, Boiling Lake is a geothermal wonder surrounded by lush rainforest. The hike to the lake offers stunning views and a chance to experience the island's volcanic activity.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Emerald Pool",
    "city": "Morne Trois Pitons National Park",
    "type": "nature",
    "description": "A serene natural pool surrounded by tropical vegetation, the Emerald Pool is accessible via a short hike. Its crystal-clear water and the sound of cascading waterfalls create a peaceful retreat.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Trafalgar Falls",
    "city": "Trafalgar",
    "type": "nature",
    "description": "These twin waterfalls are a breathtaking sight, with one waterfall cascading over 125 feet. Visitors can hike to the viewing area and enjoy the lush surroundings, making it a perfect spot for photography.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Roseau",
    "city": "Roseau",
    "type": "culture",
    "description": "The capital city of Dominica, Roseau is rich in history and culture. Visitors can explore its colorful markets, colonial architecture, and the vibrant local lifestyle.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Kalinago Territory",
    "city": "Salybia",
    "type": "culture",
    "description": "Home to the indigenous Kalinago people, this area offers a glimpse into their rich heritage. Visitors can learn about traditional crafts, try local cuisine, and experience the culture firsthand.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Cabrits National Park",
    "city": "Portsmouth",
    "type": "nature",
    "description": "This national park features beautiful landscapes, hiking trails, and historical ruins, including Fort Shirley. The park is also a great spot for birdwatching and diving.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Mero Beach",
    "city": "Mero",
    "type": "nature",
    "description": "Known for its golden sand and crystal-clear waters, Mero Beach is a popular spot for sunbathing and swimming. The beach is less crowded than others, providing a tranquil atmosphere.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Sari Sari Waterfall",
    "city": "Sari Sari",
    "type": "nature",
    "description": "A hidden gem, Sari Sari Waterfall requires a hike to reach but rewards visitors with stunning views and a refreshing swim. The surrounding forest is home to diverse wildlife.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Old Mill Cultural Center",
    "city": "Roseau",
    "type": "culture",
    "description": "This cultural center showcases Dominica's history through art, music, and craft exhibitions. It's a great place to learn about the island's heritage and participate in local events.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Dominica Museum",
    "city": "Roseau",
    "type": "culture",
    "description": "Located in a historic building, the museum offers insights into Dominica's history, culture, and natural environment. Exhibits include artifacts from the indigenous Kalinago people and colonial times.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "L'Express des Îles",
    "city": "Roseau",
    "type": "entertainment",
    "description": "This ferry service offers boat trips to nearby islands, providing a unique way to explore the Caribbean. Enjoy stunning views while discovering hidden gems in the surrounding waters.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Syndicate Nature Trail",
    "city": "Syndicate",
    "type": "nature",
    "description": "This well-maintained trail is perfect for birdwatchers, as it is home to the endangered Sisserou Parrot. The hike leads through beautiful rainforest, showcasing the island's biodiversity.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Champagne Reef",
    "city": "Soufrière",
    "type": "nature",
    "description": "This underwater volcanic site features bubbling hot springs and vibrant marine life. Snorkeling here offers a unique experience to see the natural phenomena up close.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Waitukubuli National Trail",
    "city": "Multiple Locations",
    "type": "nature",
    "description": "This long-distance trail spans the length of Dominica, showcasing the island's diverse landscapes and ecosystems. Hikers can experience everything from lush rainforests to mountain peaks.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Dominica Botanical Gardens",
    "city": "Roseau",
    "type": "nature",
    "description": "Home to a variety of tropical plants and flowers, the gardens are a peaceful escape in the capital. Visitors can stroll through the well-maintained paths and enjoy the beautiful scenery.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Moroccan Spice Garden",
    "city": "Salisbury",
    "type": "nature",
    "description": "This unique garden offers guided tours showcasing the cultivation of spices and herbs. Visitors can learn about the island's agricultural practices and taste local flavors.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Fort Shirley",
    "city": "Portsmouth",
    "type": "landmark",
    "description": "A historical site dating back to the 18th century, Fort Shirley offers stunning views of the harbor and surrounding landscape. The site is rich in history and is a great place for exploration.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Titou Gorge",
    "city": "Soufrière",
    "type": "nature",
    "description": "A hidden paradise, Titou Gorge is a narrow river gorge where visitors can swim in clear waters surrounded by towering rock walls. The scenery is breathtaking and offers a unique swimming experience.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Cabrits",
    "city": "Portsmouth",
    "type": "nature",
    "description": "A volcanic ridge rising from the sea, The Cabrits offers stunning views and hiking trails. Visitors can explore the area's rich biodiversity and historical forts.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Cocoa Plantation Tours",
    "city": "Multiple Locations",
    "type": "culture",
    "description": "Experience the chocolate-making process on a cocoa plantation tour. Learn about the history of cocoa in Dominica and taste delicious locally produced chocolate.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Hiking to Morne Diablotin",
    "city": "Salybia",
    "type": "nature",
    "description": "As the highest peak in Dominica, Morne Diablotin offers challenging hikes with rewarding panoramic views. Adventurers can explore the diverse ecosystems along the trail.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Scott's Head Marine Reserve",
    "city": "Scott's Head",
    "type": "nature",
    "description": "This marine reserve is a haven for snorkelers and divers, featuring vibrant coral reefs and diverse marine life. The stunning underwater scenery makes it a must-visit destination.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Rosalie Bay",
    "city": "Rosalie",
    "type": "nature",
    "description": "A picturesque beach known for its black sand and tranquil waters, Rosalie Bay is perfect for relaxation and nature walks. The surrounding area is rich in wildlife and offers great hiking opportunities.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Boiling Lake Trail",
    "city": "Morne Trois Pitons National Park",
    "type": "nature",
    "description": "This challenging trail leads to the famed Boiling Lake, allowing hikers to experience the island's volcanic landscape. The journey offers stunning views and unique geothermal features.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Papillote Wilderness Retreat",
    "city": "Wotten Waven",
    "type": "entertainment",
    "description": "Set in a tropical garden, this retreat offers hot mineral springs and spa services. It's an ideal spot for relaxation and rejuvenation after exploring the island.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Old Stone Church",
    "city": "Morne Bruce",
    "type": "landmark",
    "description": "Built in the 18th century, this church is a testament to Dominica's colonial history. Its architecture and beautiful surroundings make it a popular spot for photography.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Freshwater Lake",
    "city": "Morne Trois Pitons National Park",
    "type": "nature",
    "description": "This serene lake surrounded by lush forests is perfect for picnics and birdwatching. It is a great place to connect with nature and enjoy the peaceful surroundings.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Laudat Village",
    "city": "Laudat",
    "type": "culture",
    "description": "This charming village offers a glimpse into local life and culture. Visitors can explore traditional crafts, enjoy local cuisine, and experience the warm hospitality of the residents.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "Nature Island Tours",
    "city": "Roseau",
    "type": "entertainment",
    "description": "Offering guided tours of the best natural attractions on the island, Nature Island Tours provides a personalized experience for exploring Dominica's beauty and biodiversity.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Caribbean Sea",
    "city": "Multiple Locations",
    "type": "nature",
    "description": "The stunning waters surrounding Dominica are perfect for sailing, diving, and fishing. The vibrant marine life and clear waters make it a paradise for water enthusiasts.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Kalinago Barana Auté",
    "city": "Salybia",
    "type": "culture",
    "description": "An indigenous cultural village that offers insights into the Kalinago way of life. Visitors can enjoy traditional crafts, music, and food while learning about the history of the indigenous people.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Roseau River",
    "city": "Roseau",
    "type": "nature",
    "description": "A beautiful river that flows through the capital, offering opportunities for kayaking and nature walks. The surrounding area is rich in lush vegetation and wildlife.",
    "country": "Dominica",
    "country_rank": 4
  },
  {
    "name": "The Nature Island Festival",
    "city": "Roseau",
    "type": "entertainment",
    "description": "An annual festival celebrating Dominica's culture, music, and cuisine. The event features local artists, traditional performances, and showcases the island's rich heritage.",
    "country": "Dominica",
    "country_rank": 4
  }
]
