[
  {
    "name": "Marina Bay Sands",
    "city": "Singapore",
    "type": "landmark",
    "description": "A stunning integrated resort featuring a unique boat-shaped sky park, infinity pool, and luxurious accommodations. It's a symbol of modern Singapore and offers breathtaking views of the skyline.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Gardens by the Bay",
    "city": "Singapore",
    "type": "nature",
    "description": "A futuristic park featuring the iconic Supertree Grove and the Cloud Forest dome. It's a perfect blend of nature and technology, showcasing diverse plant species in stunning floral displays.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Sentosa Island",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A resort island packed with attractions, including Universal Studios Singapore, Adventure Cove Waterpark, and beautiful beaches. It's a popular getaway for both locals and tourists.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Chinatown",
    "city": "Singapore",
    "type": "culture",
    "description": "Rich in history and culture, Chinatown boasts vibrant streets filled with traditional shops, temples, and food stalls. Visitors can explore the Chinatown Heritage Centre to learn about the area’s past.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Little India",
    "city": "Singapore",
    "type": "culture",
    "description": "A colorful district that immerses visitors in Indian culture with its vibrant shops, delicious cuisine, and intricate temples. The Sri Veeramakaliamman Temple is a notable highlight.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Clarke Quay",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A riverside quay known for its lively nightlife and dining options. The historic warehouses have been transformed into restaurants, bars, and clubs, drawing both locals and tourists.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Orchard Road",
    "city": "Singapore",
    "type": "entertainment",
    "description": "Singapore's famous shopping street, lined with malls, boutiques, and eateries. It's a haven for shoppers looking for luxury brands and unique finds.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Botanic Gardens",
    "city": "Singapore",
    "type": "nature",
    "description": "A UNESCO World Heritage site, this lush garden features a vast collection of tropical plants and the iconic National Orchid Garden. It's a peaceful retreat in the heart of the city.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Raffles Hotel",
    "city": "Singapore",
    "type": "landmark",
    "description": "An iconic colonial-era hotel known for its luxurious accommodations and the famous Singapore Sling cocktail. The hotel's architecture and history make it a must-visit landmark.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "East Coast Park",
    "city": "Singapore",
    "type": "nature",
    "description": "A popular outdoor destination for beach activities, cycling, and picnicking. The park offers a beautiful coastline and ample space for recreational activities.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Kampong Glam",
    "city": "Singapore",
    "type": "culture",
    "description": "A historic neighborhood that reflects Singapore's Malay and Muslim heritage, featuring the majestic Sultan Mosque and colorful shophouses. It's a culturally rich area with unique shops and eateries.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Haw Par Villa",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A quirky theme park showcasing Chinese mythology and folklore through colorful sculptures and dioramas. It's an offbeat attraction that's both entertaining and educational.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Bukit Timah Nature Reserve",
    "city": "Singapore",
    "type": "nature",
    "description": "Home to Singapore's highest natural point, this reserve features lush rainforests and diverse wildlife. It's a great destination for hiking and nature enthusiasts.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Fort Canning Park",
    "city": "Singapore",
    "type": "landmark",
    "description": "A historical park that was once the site of a fort and military base. It now features beautiful gardens, heritage trails, and a variety of events throughout the year.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Pulau Ubin",
    "city": "Singapore",
    "type": "nature",
    "description": "A small island that offers a glimpse of Singapore's rustic past, featuring traditional kampong houses and lush nature trails. It's a great spot for cycling and exploring nature.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Lazarus Island",
    "city": "Singapore",
    "type": "nature",
    "description": "A hidden gem known for its serene beaches and clear waters. It's a perfect escape from the city, offering tranquility and natural beauty.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The Southern Ridges",
    "city": "Singapore",
    "type": "nature",
    "description": "A 10-kilometer hiking trail that connects several parks and nature reserves. It features scenic views, lush greenery, and the iconic Henderson Waves bridge.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Sungei Buloh Wetland Reserve",
    "city": "Singapore",
    "type": "nature",
    "description": "A unique nature reserve that showcases Singapore's rich biodiversity, particularly its migratory birds. The boardwalks and observation hides make it an excellent spot for birdwatching.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Peranakan Museum",
    "city": "Singapore",
    "type": "culture",
    "description": "A museum dedicated to the heritage of the Peranakan culture, showcasing their unique customs, clothing, and artifacts. It's a fascinating insight into this vibrant community.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "National Gallery Singapore",
    "city": "Singapore",
    "type": "culture",
    "description": "Home to an extensive collection of Southeast Asian art, this gallery is housed in the former Supreme Court and City Hall. It offers a blend of contemporary and historical art exhibitions.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Toa Payoh Heritage Trail",
    "city": "Singapore",
    "type": "culture",
    "description": "A walking trail that showcases the history and culture of Toa Payoh, featuring landmarks like the Toa Payoh Dragon Playground and various public art installations.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Discovery Centre",
    "city": "Singapore",
    "type": "entertainment",
    "description": "An interactive attraction that highlights Singapore's history, innovation, and resilience through multimedia exhibits. It's a fun and educational experience for all ages.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Tiong Bahru",
    "city": "Singapore",
    "type": "culture",
    "description": "One of Singapore's oldest residential neighborhoods, known for its Art Deco architecture and vibrant food scene. It's a great area to explore local cafes, boutiques, and markets.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Changi Beach Park",
    "city": "Singapore",
    "type": "nature",
    "description": "A scenic beach park that offers a tranquil escape with picnic spots, walking trails, and views of the sea. It's perfect for relaxing or enjoying outdoor activities.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The Intan",
    "city": "Singapore",
    "type": "culture",
    "description": "A private Peranakan home museum showcasing a collection of artifacts and antiques. Guided tours provide an intimate look into the rich culture and history of the Peranakan community.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Kranji Marshes",
    "city": "Singapore",
    "type": "nature",
    "description": "A tranquil nature reserve featuring wetlands and diverse wildlife. It's an excellent spot for birdwatching and enjoying the serene natural surroundings.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Jewel Changi Airport",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A stunning airport complex featuring the world's tallest indoor waterfall, a lush indoor garden, and a variety of shopping and dining options. It's a unique attraction even for non-travelers.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Flyer",
    "city": "Singapore",
    "type": "landmark",
    "description": "One of the world's largest observation wheels, offering panoramic views of the city skyline and beyond. It's a must-visit for breathtaking sunset views.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Haji Lane",
    "city": "Singapore",
    "type": "culture",
    "description": "A narrow street known for its colorful murals, boutique shops, and hip cafes. It's a trendy spot for shopping, dining, and street photography.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Bugis Street",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A bustling shopping street filled with stalls selling clothes, accessories, and street food. It's a vibrant area that captures the essence of Singapore's street market culture.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Science Centre",
    "city": "Singapore",
    "type": "entertainment",
    "description": "An interactive science museum featuring hands-on exhibits and educational programs. It's a great destination for families and science enthusiasts.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Air Force Museum",
    "city": "Singapore",
    "type": "culture",
    "description": "A museum dedicated to Singapore's air force history, showcasing aircraft, memorabilia, and interactive exhibits. It's an interesting visit for aviation enthusiasts.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The Artground",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A creative space for children and families that hosts interactive art installations and performances. It encourages creativity and imagination through engaging activities.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The Projector",
    "city": "Singapore",
    "type": "entertainment",
    "description": "An independent cinema located in a retro building, offering a selection of indie films, classics, and themed screenings. It's a unique experience for movie lovers.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Buddha Tooth Relic Temple",
    "city": "Singapore",
    "type": "culture",
    "description": "A stunning Buddhist temple in Chinatown that houses a relic believed to be a tooth of the Buddha. The intricate architecture and tranquil atmosphere make it a serene place to visit.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "S.E.A. Aquarium",
    "city": "Singapore",
    "type": "entertainment",
    "description": "One of the largest aquariums in the world, featuring over 100,000 marine animals. It's an educational and awe-inspiring attraction for visitors of all ages.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Zoo",
    "city": "Singapore",
    "type": "entertainment",
    "description": "Renowned for its open concept and naturalistic habitats, the zoo is home to a wide variety of animals. It's a great destination for families and wildlife enthusiasts.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Night Safari",
    "city": "Singapore",
    "type": "entertainment",
    "description": "The world's first nocturnal zoo where visitors can observe animals in their natural nighttime behavior. It's a unique experience that brings wildlife to life under the stars.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Labrador Nature Reserve",
    "city": "Singapore",
    "type": "nature",
    "description": "A coastal park with scenic views of the sea and rich biodiversity. It's a great spot for walks, picnics, and exploring historical remnants from World War II.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Philatelic Museum",
    "city": "Singapore",
    "type": "culture",
    "description": "A museum dedicated to the history of stamps and postal services in Singapore. It offers insight into the country's history through philately.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Thian Hock Keng Temple",
    "city": "Singapore",
    "type": "culture",
    "description": "One of the oldest Hokkien temples in Singapore, dedicated to Ma Zu Po, the sea goddess. The intricate carvings and historical significance make it a cultural landmark.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Fort Siloso",
    "city": "Singapore",
    "type": "landmark",
    "description": "A preserved coastal fort from World War II, featuring tunnels and displays on Singapore's military history. It's an interesting historical site to explore.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The Helix Bridge",
    "city": "Singapore",
    "type": "landmark",
    "description": "A pedestrian bridge that connects Marina Centre with Marina South. Its unique DNA-inspired design and nighttime illumination make it a striking architectural feature.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Coney Island",
    "city": "Singapore",
    "type": "nature",
    "description": "A tranquil island park with diverse habitats, including mangroves and coastal forests. It's perfect for nature walks and birdwatching.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Naiise",
    "city": "Singapore",
    "type": "culture",
    "description": "A unique retail space that showcases local artisans' products, from crafts to food. It's a great place to find authentic Singaporean souvenirs.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Art Museum",
    "city": "Singapore",
    "type": "culture",
    "description": "A contemporary art museum focused on Southeast Asian art, hosting rotating exhibitions and educational programs. It's a hub for art lovers and creators.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The National Museum of Singapore",
    "city": "Singapore",
    "type": "culture",
    "description": "The oldest museum in Singapore, featuring exhibits on Singapore's history and culture. Its stunning architecture and engaging displays make it a must-visit.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Changi Chapel and Museum",
    "city": "Singapore",
    "type": "culture",
    "description": "A museum dedicated to the memory of those who suffered during the Japanese Occupation of Singapore. It provides insights into the resilience of the human spirit.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Riverside Walk",
    "city": "Singapore",
    "type": "nature",
    "description": "A scenic walking trail along the Singapore River, offering picturesque views of the city skyline and historical landmarks. It's perfect for a leisurely stroll.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Kampong Lorong Buangkok",
    "city": "Singapore",
    "type": "culture",
    "description": "The last remaining kampong (village) in Singapore, providing a glimpse into the country's past. It's a charming area with traditional houses and a sense of nostalgia.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "NUS Museum",
    "city": "Singapore",
    "type": "culture",
    "description": "Located within the National University of Singapore, this museum showcases a collection of art and cultural artifacts. It offers unique exhibitions and educational programs.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Geylang Serai Market",
    "city": "Singapore",
    "type": "culture",
    "description": "A bustling market known for its vibrant atmosphere and local Malay and Muslim delicacies. It's a great place to experience authentic Singaporean street food.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Dempsey Hill",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A trendy dining and lifestyle destination set in a former military barracks. It features a variety of restaurants, shops, and art galleries in a lush setting.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore River Cruise",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A scenic boat ride along the Singapore River, offering views of the city’s historical landmarks and modern architecture. It's a relaxing way to explore the waterfront.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The Arts House",
    "city": "Singapore",
    "type": "culture",
    "description": "A historical building that serves as a venue for arts and cultural events, including performances and exhibitions. It's a cultural hub in the heart of the city.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Singapore Chinese Cultural Centre",
    "city": "Singapore",
    "type": "culture",
    "description": "A center dedicated to promoting Chinese culture in Singapore, featuring exhibitions, performances, and educational programs. It's a vibrant space for cultural exchange.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "The Coffee Academics",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A specialty coffee shop known for its artisanal brews and coffee classes. It’s a cozy spot for coffee lovers to relax and learn about their favorite beverage.",
    "country": "Singapore",
    "country_rank": 9
  },
  {
    "name": "Seletar Aerospace Park",
    "city": "Singapore",
    "type": "entertainment",
    "description": "A unique destination for aviation enthusiasts, featuring a mix of aerospace companies, dining options, and recreational areas. It's a hidden gem away from the city bustle.",
    "country": "Singapore",
    "country_rank": 9
  }
]
