[
  {
    "name": "Vaduz Castle",
    "city": "Vaduz",
    "type": "landmark",
    "description": "A striking symbol of Liechtenstein, Vaduz Castle offers stunning panoramic views of the surrounding valley. It has been the residence of the princely family since the 12th century and is a must-see for history enthusiasts.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Kunstmuseum Liechtenstein",
    "city": "Vaduz",
    "type": "culture",
    "description": "This contemporary art museum houses an impressive collection of modern art and hosts temporary exhibitions. Its architecture is as striking as the art it contains, making it a cultural highlight in Vaduz.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Liechtenstein National Museum",
    "city": "Vaduz",
    "type": "culture",
    "description": "The museum showcases the cultural history and natural heritage of Liechtenstein. Visitors can explore artifacts, exhibitions, and gain insights into the unique traditions of this small principality.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Malbun",
    "city": "Malbun",
    "type": "nature",
    "description": "A picturesque mountain village known for its skiing and hiking opportunities. Malbun is perfect for outdoor enthusiasts, with trails that offer breathtaking views of the Alps.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Schaan",
    "city": "Schaan",
    "type": "culture",
    "description": "Schaan is the largest municipality in Liechtenstein and features charming streets, local eateries, and cultural sites. The town provides insight into everyday life in this small nation.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Gutenberg Castle",
    "city": "Balzers",
    "type": "landmark",
    "description": "This medieval castle offers a glimpse into Liechtenstein's past and is set against a stunning mountain backdrop. Visitors can explore the castle grounds and enjoy the scenic views of the Rhine Valley.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Rheinpark Stadion",
    "city": "Vaduz",
    "type": "entertainment",
    "description": "The home of FC Vaduz, this stadium hosts various sporting events and concerts. It's a great place to experience local culture and community spirit.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Prince's Wine Cellars",
    "city": "Vaduz",
    "type": "culture",
    "description": "Located beneath the Vaduz Castle, these wine cellars offer a taste of the region's fine wines. Guided tours provide insights into the wine-making process and the history of the local viticulture.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Vaduz Cathedral",
    "city": "Vaduz",
    "type": "landmark",
    "description": "Officially known as the Cathedral of St. Florin, this neo-Gothic cathedral is a stunning architectural gem. Its beautiful stained glass windows and serene atmosphere make it a peaceful place to visit.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Furstensteig",
    "city": "Various",
    "type": "nature",
    "description": "This scenic hiking trail connects the capital, Vaduz, to the stunning mountain views above. It’s ideal for hikers looking for a mix of adventure and breathtaking landscapes.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Schellenberg",
    "city": "Schellenberg",
    "type": "culture",
    "description": "This charming village is known for its historical significance and local folklore. Visitors can explore the old town, which features traditional architecture and local art.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Liechtenstein Trail",
    "city": "Various",
    "type": "nature",
    "description": "A long-distance hiking trail that traverses the entire country from north to south. It showcases the diverse landscapes and stunning views of Liechtenstein's mountains and valleys.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Heiligkreuz Chapel",
    "city": "Malbun",
    "type": "landmark",
    "description": "A hidden gem located in the mountains, this chapel features beautiful frescoes and a peaceful atmosphere. It's a perfect spot for reflection amidst nature.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Balzers",
    "city": "Balzers",
    "type": "culture",
    "description": "A picturesque village that offers a glimpse into Liechtenstein's rural life, Balzers is home to charming houses and beautiful landscapes. The village is ideal for a quiet stroll.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Schaanwald",
    "city": "Schaanwald",
    "type": "nature",
    "description": "This area is known for its lush forests and nature trails. It’s a great location for hiking, cycling, and enjoying the tranquility of nature.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Triesenberg",
    "city": "Triesenberg",
    "type": "nature",
    "description": "A quaint village known for its stunning views of the Rhine Valley and the Alps. It's a great starting point for hiking and exploring the surrounding nature.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Vaduzer Post",
    "city": "Vaduz",
    "type": "entertainment",
    "description": "A unique local spot that combines a post office with a café and art gallery. It’s an interesting place to relax, enjoy a coffee, and appreciate local art.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Hochstollen",
    "city": "Malbun",
    "type": "nature",
    "description": "A beautiful hiking area that offers stunning vistas and unique rock formations. It's less frequented, providing a serene atmosphere for nature lovers.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Bergbahn Malbun",
    "city": "Malbun",
    "type": "entertainment",
    "description": "The cable car in Malbun takes visitors to higher altitudes for skiing and hiking. The ride offers breathtaking views of the surrounding mountains.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Vaduz City Park",
    "city": "Vaduz",
    "type": "nature",
    "description": "A lovely park located near the center of Vaduz, perfect for a leisurely stroll or a picnic. It features beautiful gardens, walking paths, and a playground.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Alpenrock",
    "city": "Vaduz",
    "type": "entertainment",
    "description": "An adventurous rock climbing center that offers courses for all levels. It’s a fun way to experience the thrill of climbing in a safe environment.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Casino Liechtenstein",
    "city": "Vaduz",
    "type": "entertainment",
    "description": "A stylish casino that provides entertainment and gaming options in a luxurious setting. It’s a great place to spend an evening trying your luck.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Vaduzer Städtle",
    "city": "Vaduz",
    "type": "culture",
    "description": "The charming pedestrian area of Vaduz filled with shops, cafes, and cultural spots. It's perfect for a leisurely day out and experiencing local life.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "St. Mamerten Chapel",
    "city": "Balzers",
    "type": "landmark",
    "description": "A quaint chapel located in the scenic village of Balzers, known for its beautiful frescoes and serene surroundings. It's a peaceful place for quiet contemplation.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Burg Gutenberg",
    "city": "Balzers",
    "type": "landmark",
    "description": "This historic castle offers fascinating insights into the medieval history of Liechtenstein. Visitors can explore the ruins and enjoy the beautiful views from its heights.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Liechtenstein History Museum",
    "city": "Vaduz",
    "type": "culture",
    "description": "This museum tells the story of Liechtenstein through various exhibits showcasing its history, culture, and development. It’s a great place to learn about the principality.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Ski Resort Malbun",
    "city": "Malbun",
    "type": "entertainment",
    "description": "A popular destination for winter sports enthusiasts, Malbun offers skiing, snowboarding, and sledding. It’s perfect for families and adventure-seekers alike.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Old Bridge",
    "city": "Vaduz",
    "type": "landmark",
    "description": "An iconic bridge that connects Vaduz to the neighboring town of Schaan. It offers lovely views of the Rhine River and is a great spot for photography.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Feldkirch",
    "city": "Feldkirch",
    "type": "culture",
    "description": "While technically in Austria, this nearby city is worth a visit for its historic architecture and vibrant culture. It’s a short trip from Liechtenstein and offers a rich experience.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "Schneeflucht",
    "city": "Malbun",
    "type": "nature",
    "description": "A serene mountain area known for its tranquility and stunning views. It’s perfect for those looking to escape the hustle and bustle of everyday life.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Liechtenstein Adventure Park",
    "city": "Vaduz",
    "type": "entertainment",
    "description": "An outdoor adventure park offering various activities such as zip-lining and climbing. It’s ideal for families and thrill-seekers looking for fun.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Prince's Garden",
    "city": "Vaduz",
    "type": "nature",
    "description": "A beautifully landscaped garden near Vaduz Castle, perfect for a peaceful walk. The garden features a variety of plants and provides stunning views of the castle.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The National Library of Liechtenstein",
    "city": "Vaduz",
    "type": "culture",
    "description": "A library that offers a vast collection of books and resources on Liechtenstein’s culture and history. It’s a quiet place for research or reading.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Old Town of Vaduz",
    "city": "Vaduz",
    "type": "culture",
    "description": "The historical center of Vaduz features charming streets, shops, and cafes. It’s a great place to immerse oneself in the local culture and architecture.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Vaduz Art Gallery",
    "city": "Vaduz",
    "type": "culture",
    "description": "A small but impressive art gallery showcasing local artists and contemporary works. It’s a hidden gem for art lovers visiting Vaduz.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Ruggeller Riet Nature Reserve",
    "city": "Ruggell",
    "type": "nature",
    "description": "A unique wetland area that is home to diverse flora and fauna. It’s a great spot for birdwatching and enjoying nature walks.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Liechtenstein Museum of Fine Arts",
    "city": "Vaduz",
    "type": "culture",
    "description": "This museum features a diverse collection of fine arts, including works from Liechtenstein and beyond. It’s an enriching experience for art enthusiasts.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Vaduz Wine Trail",
    "city": "Vaduz",
    "type": "entertainment",
    "description": "A scenic trail that winds through vineyards, allowing visitors to sample local wines. It’s a delightful way to experience the region's viticulture.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Bendern Chapel",
    "city": "Bendern",
    "type": "landmark",
    "description": "A charming chapel with beautiful architecture and peaceful surroundings. It’s a quiet spot for reflection and appreciation of local history.",
    "country": "Liechtenstein",
    "country_rank": 6
  },
  {
    "name": "The Alpine Wildlife Park",
    "city": "Malbun",
    "type": "nature",
    "description": "A park dedicated to preserving and showcasing native alpine wildlife. Visitors can see animals in their natural habitats and learn about conservation efforts.",
    "country": "Liechtenstein",
    "country_rank": 6
  }
]
