[
  {
    "name": "Hunza Valley",
    "city": "Hunza",
    "type": "nature",
    "description": "A stunning mountainous region known for its breathtaking landscapes, lush greenery, and rich culture. The valley is surrounded by some of the highest peaks in the Karakoram range.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Fairy Meadows",
    "city": "Nagar",
    "type": "nature",
    "description": "A beautiful grassland near Nanga Parbat, offering spectacular views and a serene environment. It is a popular base camp for trekkers and nature lovers.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Skardu",
    "city": "Skardu",
    "type": "nature",
    "description": "Renowned for its majestic mountains and crystal-clear lakes, Skardu is a gateway to some of the world's highest peaks. The serene Sheosar Lake and the stunning Deosai National Park are nearby.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Mohenjo-Daro",
    "city": "Larkana",
    "type": "culture",
    "description": "An archaeological site of an ancient Indus Valley Civilization city, showcasing advanced urban planning and architecture. It's a UNESCO World Heritage Site and offers insights into early human civilization.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Karimabad",
    "city": "Hunza",
    "type": "culture",
    "description": "The capital of the Hunza District, known for its ancient forts, vibrant culture, and panoramic views of the surrounding mountains. Baltit Fort and Altit Fort are key attractions here.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Ratti Gali Lake",
    "city": "Azad Kashmir",
    "type": "nature",
    "description": "A hidden gem nestled in the Neelum Valley, this alpine glacial lake is surrounded by lush green meadows and snow-capped peaks. It's perfect for hiking and offers stunning photography opportunities.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Shandur Pass",
    "city": "Chitral",
    "type": "nature",
    "description": "Home to the highest polo ground in the world, this scenic pass connects Chitral and Gilgit. The annual Shandur Polo Festival attracts visitors from around the world.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Mohatta Palace",
    "city": "Karachi",
    "type": "landmark",
    "description": "A beautiful heritage building built in the 1920s, showcasing ornate architecture and housing a museum. It reflects the rich cultural history of Karachi and provides a glimpse into the past.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Lal Shahbaz Qalandar Shrine",
    "city": "Sehwan",
    "type": "culture",
    "description": "A revered Sufi shrine dedicated to the saint Lal Shahbaz Qalandar, known for its spiritual significance and vibrant annual celebrations. The shrine is adorned with colorful decorations and attracts pilgrims from across the country.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Neelum Valley",
    "city": "Azad Kashmir",
    "type": "nature",
    "description": "A picturesque valley known for its lush landscapes, rivers, and traditional wooden houses. The valley offers numerous hiking trails and opportunities to explore local culture.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Kaghan Valley",
    "city": "Mansehra",
    "type": "nature",
    "description": "Famous for its stunning scenery, including crystal-clear lakes and towering mountains. The valley is a popular destination for trekking and adventure tourism.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Naltar Valley",
    "city": "Gilgit",
    "type": "nature",
    "description": "Known for its vibrant, colored lakes and lush meadows, Naltar Valley is a hidden paradise. It is less frequented by tourists, making it an ideal spot for those seeking tranquility.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Taxila",
    "city": "Taxila",
    "type": "culture",
    "description": "An ancient city that was once a center of learning and culture during the Gandhara period. The archaeological site is a UNESCO World Heritage Site, featuring ruins of stupas, monasteries, and sculptures.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Khewra Salt Mine",
    "city": "Khewra",
    "type": "landmark",
    "description": "The largest salt mine in Pakistan, famous for its stunning underground chambers and salt formations. It's a unique attraction that offers guided tours through its historical tunnels.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Sawat Valley",
    "city": "Mingora",
    "type": "nature",
    "description": "Known for its lush green hills, rivers, and cultural heritage, Swat Valley is often referred to as the 'Switzerland of the East.' It offers opportunities for trekking and immersing in local traditions.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Wadi e Swat",
    "city": "Swat",
    "type": "nature",
    "description": "A breathtaking valley with crystal-clear rivers, lush forests, and snow-capped mountains. It is less commercialized, making it a hidden gem for nature lovers.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Badshahi Mosque",
    "city": "Lahore",
    "type": "landmark",
    "description": "One of the largest mosques in the world, renowned for its stunning Mughal architecture and intricate calligraphy. The mosque is a symbol of Lahore's rich cultural history.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Chitral Valley",
    "city": "Chitral",
    "type": "nature",
    "description": "Known for its rich cultural diversity and stunning natural beauty, Chitral Valley is home to the Kalash people. The valley offers unique traditions and breathtaking landscapes.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Brahmaputra River",
    "city": "Gilgit-Baltistan",
    "type": "nature",
    "description": "A pristine river known for its stunning views and adventure activities such as rafting and kayaking. The surrounding area is rich in biodiversity.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Peshawar Museum",
    "city": "Peshawar",
    "type": "culture",
    "description": "Home to a vast collection of Gandharan art and artifacts, the museum showcases the region's rich historical heritage. It's a must-visit for history enthusiasts.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Kaghan Valley",
    "city": "Kaghan",
    "type": "nature",
    "description": "Famous for its scenic beauty, including the breathtaking Saif-ul-Malook Lake. The valley offers opportunities for trekking, fishing, and enjoying the tranquility of nature.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Margalla Hills",
    "city": "Islamabad",
    "type": "nature",
    "description": "A mountain range offering hiking trails, panoramic views of Islamabad, and rich biodiversity. It's a popular spot for outdoor activities and enjoying nature.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Lal Suhanra National Park",
    "city": "Bahawalpur",
    "type": "nature",
    "description": "A vast national park known for its diverse wildlife, wetlands, and scenic landscapes. It's an ideal destination for nature lovers and bird watchers.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Khanpur Dam",
    "city": "Khanpur",
    "type": "entertainment",
    "description": "A popular recreational spot for water sports, picnics, and boating activities. The dam is surrounded by beautiful hills and offers a perfect getaway from city life.",
    "country": "Pakistan",
    "country_rank": 3
  },
  {
    "name": "Khan's Village",
    "city": "Karachi",
    "type": "entertainment",
    "description": "A vibrant cultural village showcasing traditional crafts, music, and cuisine. It's a unique destination for experiencing the local culture and arts.",
    "country": "Pakistan",
    "country_rank": 3
  }
]
