[
  {
    "name": "Machu Picchu",
    "city": "Aguas Calientes",
    "type": "landmark",
    "description": "An ancient Incan city set high in the Andes Mountains, Machu Picchu is famous for its archaeological significance and breathtaking panoramic views. It is a UNESCO World Heritage site and one of the New Seven Wonders of the World.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cusco",
    "city": "Cusco",
    "type": "culture",
    "description": "Once the capital of the Inca Empire, Cusco is a city rich in history and culture. Visitors can explore its cobblestone streets, colonial architecture, and nearby archaeological sites.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Nazca Lines",
    "city": "Nazca",
    "type": "landmark",
    "description": "A series of large ancient geoglyphs located in the Nazca Desert, the Nazca Lines are best viewed from the air. Their purpose and creation remain a mystery, making them a fascinating destination.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Lake Titicaca",
    "city": "Puno",
    "type": "nature",
    "description": "The highest navigable lake in the world, Lake Titicaca is home to unique floating islands made of totora reeds. It's a stunning place to experience traditional indigenous culture.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Sacsayhuamán",
    "city": "Cusco",
    "type": "landmark",
    "description": "An Incan archaeological site located on the outskirts of Cusco, Sacsayhuamán is known for its massive stone walls and impressive construction techniques. The site offers panoramic views of the city.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Colca Canyon",
    "city": "Chivay",
    "type": "nature",
    "description": "One of the deepest canyons in the world, Colca Canyon is a paradise for nature lovers and hikers. It's also known for its stunning landscapes and the chance to see Andean condors in flight.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Rainbow Mountain (Vinicunca)",
    "city": "Cusco",
    "type": "nature",
    "description": "Famous for its vibrant, multi-colored slopes, Rainbow Mountain is a stunning natural wonder that has become a popular trekking destination. The hike offers breathtaking views of the Andes.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Sacred Valley",
    "city": "Urubamba",
    "type": "nature",
    "description": "A picturesque valley in the Andes, the Sacred Valley is dotted with Incan ruins, traditional villages, and stunning landscapes. It's a great place to experience local culture and history.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Huacachina",
    "city": "Ica",
    "type": "entertainment",
    "description": "A desert oasis surrounded by massive sand dunes, Huacachina is a popular spot for sandboarding and dune buggy rides. The picturesque lagoon and palm trees create a unique atmosphere.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Paracas National Reserve",
    "city": "Paracas",
    "type": "nature",
    "description": "This coastal reserve is home to diverse wildlife, including sea lions, flamingos, and various bird species. Visitors can explore stunning beaches, cliffs, and the nearby Ballestas Islands.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Chan Chan",
    "city": "Trujillo",
    "type": "culture",
    "description": "The largest pre-Columbian city in South America, Chan Chan was the capital of the Chimu civilization. Its adobe walls and intricate designs make it an impressive archaeological site.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Manu National Park",
    "city": "Manu",
    "type": "nature",
    "description": "A UNESCO Biosphere Reserve, Manu National Park is one of the most biodiverse places on Earth. It offers opportunities for wildlife spotting, trekking, and experiencing indigenous cultures.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Kuelap",
    "city": "Chachapoyas",
    "type": "landmark",
    "description": "An ancient fortress built by the Chachapoya civilization, Kuelap is often less crowded than Machu Picchu. It features impressive stone walls and stunning views of the surrounding cloud forest.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Ollantaytambo",
    "city": "Ollantaytambo",
    "type": "landmark",
    "description": "This Incan archaeological site features impressive terraced ruins and a charming village that showcases traditional Andean culture. It's a popular starting point for treks to Machu Picchu.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Arequipa",
    "city": "Arequipa",
    "type": "culture",
    "description": "Known as the 'White City' for its sillar stone architecture, Arequipa boasts a rich colonial history. The Santa Catalina Monastery is a must-visit for its stunning architecture and vibrant colors.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Huascarán National Park",
    "city": "Huaraz",
    "type": "nature",
    "description": "Home to Peru's highest peak, Huascarán National Park offers breathtaking landscapes, glacial lakes, and diverse wildlife. It's a popular destination for trekking and mountaineering.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Tingo María National Park",
    "city": "Tingo María",
    "type": "nature",
    "description": "Known for its stunning landscapes and biodiversity, Tingo María National Park features lush rainforests and unique rock formations. It's an excellent location for hiking and wildlife observation.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cañón del Colca",
    "city": "Chivay",
    "type": "nature",
    "description": "Colca Canyon is twice as deep as the Grand Canyon and offers stunning views and rich cultural experiences. Visitors can enjoy hiking, hot springs, and traditional villages.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Puno",
    "city": "Puno",
    "type": "culture",
    "description": "A cultural hub on the shores of Lake Titicaca, Puno is known for its vibrant festivals and traditional music. The city's folklore and customs reflect the rich indigenous culture of the region.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Chachapoyas",
    "city": "Chachapoyas",
    "type": "culture",
    "description": "Known as the 'Warriors of the Clouds', the Chachapoyas civilization left behind impressive ruins and stunning landscapes. The town is a gateway to many archaeological sites, including Kuelap.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Iquitos",
    "city": "Iquitos",
    "type": "culture",
    "description": "The largest city in the world that cannot be reached by road, Iquitos is a gateway to the Amazon rainforest. Its unique mix of cultures and vibrant markets make it a fascinating destination.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cuzco's San Pedro Market",
    "city": "Cusco",
    "type": "culture",
    "description": "A bustling market that showcases local produce, textiles, and crafts, San Pedro Market is a great place to experience Cusco's vibrant culture. It's filled with local vendors and traditional foods.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "El Silencio",
    "city": "Lima",
    "type": "entertainment",
    "description": "An upscale restaurant and bar in Lima, El Silencio is known for its innovative Peruvian cuisine and stylish atmosphere. It's a perfect spot for food lovers looking to experience modern Peruvian dishes.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Los Ríos",
    "city": "Puno",
    "type": "nature",
    "description": "A stunning area of lakes and rivers, Los Ríos offers opportunities for kayaking, fishing, and birdwatching. It's a peaceful retreat for nature lovers.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cerro Blanco",
    "city": "Ica",
    "type": "nature",
    "description": "Cerro Blanco is one of the tallest sand dunes in the world, offering thrilling sandboarding experiences. The views from the top are breathtaking and provide a unique desert landscape.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Moray",
    "city": "Maras",
    "type": "landmark",
    "description": "An ancient Incan agricultural site, Moray features circular terraces that were used for experimental farming. The unique design and historical significance make it a fascinating visit.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Lares Hot Springs",
    "city": "Lares",
    "type": "entertainment",
    "description": "Nestled in the Andes, Lares Hot Springs is a natural thermal bath that provides relaxation after a day of trekking. The scenic surroundings enhance the experience of soaking in the warm waters.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Trek to Choquequirao",
    "city": "Cusco",
    "type": "nature",
    "description": "Often referred to as the 'sister city' of Machu Picchu, Choquequirao is an archaeological site that requires a challenging trek. The remote location ensures fewer tourists and an authentic experience.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Pachacamac",
    "city": "Lima",
    "type": "landmark",
    "description": "An ancient archaeological site located south of Lima, Pachacamac was an important religious center for the Incas. The ruins are set against a backdrop of stunning desert landscapes.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Las Salinas de Maras",
    "city": "Maras",
    "type": "culture",
    "description": "The Maras salt mines are a unique landscape of terraced salt pools that have been used since Inca times. The picturesque setting and traditional methods of salt extraction are fascinating to explore.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Pucallpa",
    "city": "Pucallpa",
    "type": "culture",
    "description": "A vibrant city in the Amazon region, Pucallpa is known for its lush surroundings and indigenous communities. The Ucayali River offers opportunities for boat tours and cultural experiences.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cachicata",
    "city": "Ollantaytambo",
    "type": "landmark",
    "description": "An ancient Incan quarry located near Ollantaytambo, Cachicata offers stunning views and insights into Incan stone-cutting techniques. The hike to the site is scenic and less crowded.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Titiqaqa Islands",
    "city": "Puno",
    "type": "nature",
    "description": "These floating islands made from totora reeds are home to the Uros people. Visitors can experience traditional lifestyles and learn about the unique culture of this indigenous community.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Llanganuco Lakes",
    "city": "Huaraz",
    "type": "nature",
    "description": "A stunning pair of glacial lakes located in the Cordillera Blanca, the Llanganuco Lakes are known for their vibrant turquoise waters. They are a popular spot for hiking and photography.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Sierra y Selva",
    "city": "Tarapoto",
    "type": "nature",
    "description": "This region offers a stunning blend of Andean and Amazonian landscapes, with plenty of opportunities for adventure activities like hiking and waterfalls. It's a hidden gem for nature enthusiasts.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cerro de Pasco",
    "city": "Pasco",
    "type": "landmark",
    "description": "One of the highest cities in the world, Cerro de Pasco is known for its mining history and unique high-altitude culture. The surrounding landscapes offer breathtaking views of the Andes.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Santa Teresa",
    "city": "Santa Teresa",
    "type": "entertainment",
    "description": "A small town near Machu Picchu, Santa Teresa is known for its hot springs and adventure activities like zip-lining and hiking. It's a great base for exploring the surrounding area.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Islas Ballestas",
    "city": "Paracas",
    "type": "nature",
    "description": "Often referred to as the 'Poor Man's Galapagos', the Ballestas Islands are home to diverse wildlife, including sea lions and penguins. Boat tours offer a unique opportunity to see these animals up close.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Tingo María",
    "city": "Tingo María",
    "type": "nature",
    "description": "Known for its stunning natural beauty, Tingo María features lush rainforests and unique rock formations. It's an excellent location for hiking and wildlife observation.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Yauyos-Cochas Landscape Reserve",
    "city": "Yauyos",
    "type": "nature",
    "description": "A lesser-known destination, this reserve features stunning landscapes of mountains and lakes. It's perfect for those looking to escape the crowds and enjoy nature.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Huamachuco",
    "city": "Huamachuco",
    "type": "culture",
    "description": "A charming town in the Andes, Huamachuco is known for its rich history and archaeological sites. The surrounding landscapes are perfect for hiking and exploring.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Qeswachaka Bridge",
    "city": "Canas",
    "type": "landmark",
    "description": "An ancient Incan bridge made of grass, Qeswachaka is a remarkable feat of engineering and tradition. The annual festival to renew the bridge attracts visitors from around the world.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cañon de Apurímac",
    "city": "Andahuaylas",
    "type": "nature",
    "description": "A stunning gorge known for its dramatic cliffs and rich biodiversity, the Apurímac Canyon is a great spot for trekking and adventure sports. The scenery is breathtaking and less traveled by tourists.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Chiclayo",
    "city": "Chiclayo",
    "type": "culture",
    "description": "Known for its rich pre-Columbian heritage, Chiclayo is home to the Lord of Sipán tomb and the Royal Tombs of Sipán Museum. The city offers insights into the Moche and Lambayeque cultures.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cerro Blanco Sand Dune",
    "city": "Ica",
    "type": "nature",
    "description": "One of the highest sand dunes in the world, Cerro Blanco offers thrilling sandboarding opportunities and stunning desert views. It's a must-visit for adventure seekers.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "La Ciudad de Dios",
    "city": "Cajamarca",
    "type": "landmark",
    "description": "An archaeological site with impressive stone structures, La Ciudad de Dios offers a glimpse into pre-Columbian life. The site is surrounded by beautiful landscapes and is less frequented by tourists.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Pacaya Samiria National Reserve",
    "city": "Iquitos",
    "type": "nature",
    "description": "One of the largest protected areas in Peru, this reserve is a biodiversity hotspot with abundant wildlife. Visitors can explore the waterways and learn about Amazonian ecosystems.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Lima's Barranco District",
    "city": "Lima",
    "type": "entertainment",
    "description": "Known for its bohemian vibe, Barranco is Lima's artsy district filled with colorful murals, galleries, and vibrant nightlife. It's a great place to experience local culture and cuisine.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Chinchero",
    "city": "Chinchero",
    "type": "culture",
    "description": "A traditional Andean village known for its weaving and textile traditions, Chinchero offers an authentic cultural experience. The town's church and ruins are also worth exploring.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Tumbes",
    "city": "Tumbes",
    "type": "nature",
    "description": "Located near the Ecuadorian border, Tumbes is known for its tropical climate and diverse ecosystems. The mangroves and beaches provide opportunities for ecotourism and outdoor activities.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "El Parque de las Leyendas",
    "city": "Lima",
    "type": "entertainment",
    "description": "A large zoo and archaeological park in Lima, Parque de las Leyendas features a variety of animals native to Peru and ancient ruins. It's a fun destination for families and nature lovers.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Ahuashiyacu Waterfall",
    "city": "Tarapoto",
    "type": "nature",
    "description": "A stunning waterfall set in a lush rainforest, Ahuashiyacu is a popular spot for swimming and picnicking. The hike to the waterfall offers beautiful views of the surrounding area.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Las Huaringas",
    "city": "Huamachuco",
    "type": "nature",
    "description": "Known for its medicinal hot springs, Las Huaringas offers a unique blend of natural beauty and wellness. The serene landscape is perfect for relaxation and rejuvenation.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Cerro San Cristobal",
    "city": "Lima",
    "type": "landmark",
    "description": "Offering panoramic views of Lima, Cerro San Cristobal is a popular viewpoint and a historic site. The hill is home to a large statue of the Virgin Mary and is a great place for a hike.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Quito's Temple of the Sun",
    "city": "Quito",
    "type": "landmark",
    "description": "An ancient Incan temple located in the city of Quito, the Temple of the Sun is a fascinating archaeological site that reflects the spiritual significance of the region.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Tumbes Mangroves",
    "city": "Tumbes",
    "type": "nature",
    "description": "A unique ecosystem along the northern coast of Peru, the Tumbes Mangroves are home to diverse wildlife and offer opportunities for kayaking and eco-tours.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "La Virgen de la Candelaria",
    "city": "Puno",
    "type": "culture",
    "description": "A significant cultural festival in Puno, La Virgen de la Candelaria celebrates the patron saint of the city with vibrant parades, traditional music, and dancing. It's an immersive cultural experience.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Chavín de Huantar",
    "city": "Huari",
    "type": "landmark",
    "description": "An ancient archaeological site, Chavín de Huantar is known for its impressive stone carvings and temples. It was a major religious center for the Chavín culture.",
    "country": "Peru",
    "country_rank": 9
  },
  {
    "name": "Pampa de Ayacucho",
    "city": "Ayacucho",
    "type": "culture",
    "description": "Known for its historical significance during the War of Independence, Pampa de Ayacucho features commemorative sites and beautiful landscapes. The area offers insights into Peru's history.",
    "country": "Peru",
    "country_rank": 9
  }
]
