[
  {
    "name": "Aphrodite's Rock",
    "city": "Paphos",
    "type": "nature",
    "description": "A stunning natural landmark, Aphrodite's Rock is steeped in mythology as the birthplace of the goddess of love. The crystal-clear waters and beautiful surroundings make it a perfect spot for swimming and photography.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Kykkos Monastery",
    "city": "Troodos Mountains",
    "type": "culture",
    "description": "One of the richest and most famous monasteries in Cyprus, Kykkos Monastery is adorned with stunning mosaics and icons. It is located in a picturesque setting, surrounded by the breathtaking Troodos Mountains.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Tala Monastery",
    "city": "Tala",
    "type": "culture",
    "description": "This serene monastery is a hidden gem located in the hills of Tala. Known for its stunning architecture and peaceful atmosphere, it offers visitors a glimpse into Cyprus's religious history.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Nissi Beach",
    "city": "Ayia Napa",
    "type": "nature",
    "description": "Famed for its golden sands and vibrant atmosphere, Nissi Beach is a hotspot for sunbathers and party-goers alike. The clear turquoise waters and nearby bars make it a lively destination.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "St. Hilarion Castle",
    "city": "Kyrenia",
    "type": "landmark",
    "description": "Perched high in the Kyrenia Mountains, St. Hilarion Castle offers stunning views and a glimpse into the island's medieval history. Its fairytale-like towers and ruins are a must-visit for history enthusiasts.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "The Akamas Peninsula",
    "city": "Paphos",
    "type": "nature",
    "description": "A UNESCO Biosphere Reserve, the Akamas Peninsula is known for its stunning landscapes, diverse wildlife, and hiking trails. The natural beauty and tranquility make it an ideal spot for nature lovers.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Larnaca Salt Lake",
    "city": "Larnaca",
    "type": "nature",
    "description": "This beautiful salt lake is home to flocks of flamingos during the winter months. The surrounding area provides picturesque walking paths and unique photo opportunities.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Kourion Archaeological Site",
    "city": "Episkopi",
    "type": "culture",
    "description": "Kourion is an ancient city-kingdom with impressive ruins, including a well-preserved amphitheater. The site offers a glimpse into the island's rich history and stunning views of the Mediterranean Sea.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Troodos Botanical Garden",
    "city": "Troodos Mountains",
    "type": "nature",
    "description": "This hidden gem showcases a variety of native flora and fauna in a serene setting. It's an excellent spot for a leisurely stroll and learning about Cyprus's unique plant life.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "The Tombs of the Kings",
    "city": "Paphos",
    "type": "culture",
    "description": "This UNESCO World Heritage site consists of impressive tombs carved out of solid rock, dating back to the 4th century BC. It provides insight into ancient burial practices and Cypriot history.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Karpaz Peninsula",
    "city": "Karpaz",
    "type": "nature",
    "description": "Known for its stunning natural beauty and wild donkeys, the Karpaz Peninsula offers pristine beaches and untouched landscapes. It's a perfect destination for those seeking solitude and adventure.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Ayia Napa Monastery",
    "city": "Ayia Napa",
    "type": "culture",
    "description": "Nestled in the heart of Ayia Napa, this 16th-century monastery is a peaceful retreat amidst the bustling tourist area. Its beautiful architecture and tranquil gardens are perfect for reflection.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Cape Greco",
    "city": "Protaras",
    "type": "nature",
    "description": "A breathtaking national park with dramatic cliffs and stunning sea views, Cape Greco is perfect for hiking and exploring hidden coves. The area is also known for its rich marine life, making it popular for snorkeling.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Famagusta Walled City",
    "city": "Famagusta",
    "type": "landmark",
    "description": "This historical site boasts impressive Venetian walls and a wealth of medieval architecture. The walled city tells the story of Famagusta's turbulent past and is a fascinating place to explore.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Paphos Harbour",
    "city": "Paphos",
    "type": "entertainment",
    "description": "A vibrant area filled with restaurants, cafes, and shops, Paphos Harbour is the perfect place to relax and enjoy the sea views. The nearby archaeological sites add a cultural touch to this lively destination.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Omodos Village",
    "city": "Limassol",
    "type": "culture",
    "description": "Known for its quaint cobblestone streets and traditional wine-making, Omodos Village is a charming destination. Visitors can explore its historic monastery and sample local delicacies.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Lefkara Village",
    "city": "Larnaca",
    "type": "culture",
    "description": "Famous for its lace and silver crafts, Lefkara Village offers a glimpse into traditional Cypriot life. The picturesque village is perfect for a leisurely stroll and shopping for handmade souvenirs.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Bellapais Abbey",
    "city": "Kyrenia",
    "type": "culture",
    "description": "An impressive Gothic abbey set against a backdrop of stunning mountains, Bellapais Abbey is a must-visit for history lovers. The serene atmosphere and beautiful architecture create a magical experience.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Blue Lagoon",
    "city": "Akamas Peninsula",
    "type": "nature",
    "description": "A hidden paradise with crystal-clear waters, the Blue Lagoon is perfect for swimming and sunbathing. Accessible by boat or hiking, this secluded spot is ideal for a peaceful day in nature.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Kissonerga Bay",
    "city": "Kissonerga",
    "type": "nature",
    "description": "A lesser-known beach destination, Kissonerga Bay offers a tranquil environment with beautiful views. The beach is perfect for relaxing away from the crowds.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Cyprus Museum",
    "city": "Nicosia",
    "type": "culture",
    "description": "The oldest and most comprehensive archaeological museum in Cyprus, it houses an extensive collection of artifacts from the island's history. A visit here provides invaluable insights into Cypriot heritage.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Paphos Castle",
    "city": "Paphos",
    "type": "landmark",
    "description": "Located at the harbor, Paphos Castle is a medieval fortress with a rich history. Visitors can explore its ruins and enjoy scenic views of the Mediterranean.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Agia Napa Sea Caves",
    "city": "Ayia Napa",
    "type": "nature",
    "description": "These stunning sea caves are a natural wonder, carved by the relentless waves over centuries. The unique formations and turquoise waters are perfect for exploration and photography.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Choirokoitia",
    "city": "Larnaca",
    "type": "culture",
    "description": "A UNESCO World Heritage site, Choirokoitia is one of the best-preserved Neolithic settlements in the Mediterranean. Visitors can explore the site and learn about ancient Cypriot life.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Kourion Beach",
    "city": "Episkopi",
    "type": "nature",
    "description": "With its golden sands and clear waters, Kourion Beach is a popular spot for sunbathing and swimming. The nearby archaeological site adds a historical aspect to this beautiful beach.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Mackenzie Beach",
    "city": "Larnaca",
    "type": "nature",
    "description": "Known for its lively atmosphere and amenities, Mackenzie Beach is perfect for families and beach lovers. The soft sand and vibrant beach bars create a fun-filled day at the coast.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "The Last Castle",
    "city": "Kyrenia",
    "type": "landmark",
    "description": "This historic castle offers stunning views of the Mediterranean and the surrounding area. It's a fascinating site for history buffs, with its well-preserved walls and rich stories.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "St. Lazarus Church",
    "city": "Larnaca",
    "type": "culture",
    "description": "An impressive 9th-century church, St. Lazarus is built over the tomb of Lazarus of Bethany. The stunning architecture and rich history make it a must-visit in Larnaca.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Fikardou Village",
    "city": "Nicosia District",
    "type": "culture",
    "description": "A beautifully preserved traditional village, Fikardou offers a glimpse into rural Cypriot life. The charming houses and local craftsmanship make it a unique destination.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Karpaz Gate Marina",
    "city": "Karpaz",
    "type": "entertainment",
    "description": "A luxurious marina offering a range of services for yacht owners, Karpaz Gate Marina is also a great place for dining and relaxation. The stunning coastal views enhance the experience.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Paleochora",
    "city": "Paphos",
    "type": "landmark",
    "description": "An ancient site with ruins dating back to the 1st century BC, Paleochora is a fascinating place to explore. The remnants of ancient churches add to its historical significance.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "The Venetian Column",
    "city": "Nicosia",
    "type": "landmark",
    "description": "A historical landmark in Nicosia, the Venetian Column stands as a symbol of the city's rich past. It offers a unique photo opportunity and insight into the island's history.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Agios Georgios",
    "city": "Paphos",
    "type": "landmark",
    "description": "A beautiful coastal village known for its picturesque views and traditional fishing boats, Agios Georgios is a serene spot for relaxation and enjoying fresh seafood.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Cavo Greco National Forest Park",
    "city": "Protaras",
    "type": "nature",
    "description": "A protected area with stunning landscapes, hiking trails, and rich biodiversity. Cavo Greco is perfect for nature lovers and offers breathtaking views of the coastline.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Mosaics of Paphos",
    "city": "Paphos",
    "type": "culture",
    "description": "Famous for their intricate designs and vibrant colors, the mosaics of Paphos are a UNESCO World Heritage site. They depict scenes from mythology and history, providing a glimpse into ancient artistry.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Agnostos Daskalos",
    "city": "Kakopetria",
    "type": "culture",
    "description": "A unique experience in Kakopetria, this hidden gem offers visitors a chance to learn about traditional Cypriot crafts and culture. Workshops and demonstrations make it a hands-on adventure.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "The Old Market",
    "city": "Nicosia",
    "type": "entertainment",
    "description": "A vibrant market in the heart of Nicosia, offering a variety of local products, crafts, and delicacies. It's an excellent place to experience the local culture and shop for unique souvenirs.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Kouris Dam",
    "city": "Limassol",
    "type": "nature",
    "description": "The largest dam in Cyprus, Kouris Dam is surrounded by beautiful landscapes and offers recreational opportunities such as picnicking and hiking. The reservoir is also a vital water supply for the region.",
    "country": "Cyprus",
    "country_rank": 7
  },
  {
    "name": "Petra tou Romiou",
    "city": "Paphos",
    "type": "nature",
    "description": "Another name for Aphrodite's Rock, this stunning coastal landmark is associated with legends of beauty and love. The dramatic scenery and relaxing atmosphere make it a favorite among visitors.",
    "country": "Cyprus",
    "country_rank": 7
  }
]
