[
  {
    "name": "Kakum National Park",
    "city": "Abrafo",
    "type": "nature",
    "description": "This tropical rainforest is famous for its canopy walkway, which offers stunning views of the lush vegetation and diverse wildlife. It’s a great spot for birdwatching and experiencing Ghana’s natural beauty.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Cape Coast Castle",
    "city": "Cape Coast",
    "type": "landmark",
    "description": "A UNESCO World Heritage site, this historic castle played a significant role in the transatlantic slave trade. Visitors can explore its dungeons and learn about its harrowing history.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Ashanti Kingdom",
    "city": "Kumasi",
    "type": "culture",
    "description": "The heart of the Ashanti culture, Kumasi is known for its rich history, traditional crafts, and the vibrant Kejetia Market. Visitors can experience the customs and ceremonies of the Ashanti people.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Mole National Park",
    "city": "Damongo",
    "type": "nature",
    "description": "This is Ghana's largest national park, home to elephants, antelopes, and various bird species. Visitors can enjoy guided walking safaris and view wildlife in their natural habitat.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Lake Volta",
    "city": "Volta Region",
    "type": "nature",
    "description": "One of the largest man-made lakes in the world, Lake Volta offers opportunities for fishing, boating, and exploring nearby villages. The scenic beauty and tranquil environment make it a perfect getaway.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Wli Waterfalls",
    "city": "Hohoe",
    "type": "nature",
    "description": "Known as the highest waterfall in West Africa, Wli Waterfalls is a breathtaking sight, surrounded by lush greenery and rich biodiversity. Hiking to the falls provides a rewarding experience.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Elmina Castle",
    "city": "Elmina",
    "type": "landmark",
    "description": "Another UNESCO World Heritage site, Elmina Castle is one of the oldest European structures in sub-Saharan Africa. It offers a poignant glimpse into the colonial history and the slave trade.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Aburi Botanical Gardens",
    "city": "Aburi",
    "type": "nature",
    "description": "Nestled in the hills, these gardens boast a wide variety of tropical plants and trees. It’s a serene place for a leisurely stroll and offers beautiful views of the surrounding landscape.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Kwame Nkrumah Mausoleum",
    "city": "Accra",
    "type": "landmark",
    "description": "This memorial honors Ghana's first president, Kwame Nkrumah. The mausoleum is surrounded by a lovely park, making it a peaceful place to reflect on Ghana's history.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Tafi Atome Monkey Sanctuary",
    "city": "Tafi Atome",
    "type": "nature",
    "description": "A community-based sanctuary that protects the Mona monkey, visitors can interact with these playful creatures while learning about conservation efforts in the area.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Nzulezo Stilt Village",
    "city": "Jomoro",
    "type": "culture",
    "description": "A unique village built entirely on stilts over Lake Amanzule, Nzulezo offers a glimpse into traditional lifestyles. Visitors can take a canoe ride to explore this extraordinary community.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Boti Falls",
    "city": "Akosombo",
    "type": "nature",
    "description": "This stunning waterfall is a must-see for nature lovers. The falls cascade down a series of rocks, creating a picturesque setting for picnics and relaxation.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Kumasi Central Market",
    "city": "Kumasi",
    "type": "culture",
    "description": "One of the largest markets in West Africa, it offers a vibrant atmosphere filled with local crafts, food, and textiles. It's an excellent spot for experiencing local culture and shopping.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "The Big Tree",
    "city": "Kumasi",
    "type": "nature",
    "description": "This ancient, towering silk cotton tree is over 400 years old and stands as a symbol of strength and resilience in the Ashanti Region. It's a popular spot for both locals and tourists.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Bregyia Waterfalls",
    "city": "Berekum",
    "type": "nature",
    "description": "A hidden gem, Bregyia Waterfalls is less frequented by tourists, providing a tranquil atmosphere. The surrounding area is perfect for hiking and enjoying nature.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Tongo Hills",
    "city": "Tongo",
    "type": "nature",
    "description": "These dramatic hills are steeped in folklore and offer stunning views of the surrounding landscape. Visitors can hike the trails and see ancient shrines and rock formations.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Keta Lagoon",
    "city": "Keta",
    "type": "nature",
    "description": "A beautiful coastal lagoon known for birdwatching and fishing, Keta Lagoon is also rich in cultural history. The serene environment is perfect for relaxation and photography.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Ankasa Conservation Area",
    "city": "Enchi",
    "type": "nature",
    "description": "This protected rainforest is home to diverse flora and fauna, including some endangered species. It's ideal for eco-tourism and offers guided tours for nature enthusiasts.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "The Osu Castle",
    "city": "Accra",
    "type": "landmark",
    "description": "Also known as Fort Christiansborg, this historic castle has served various roles throughout history, including as a slave fort. It is a significant site for understanding Ghana's colonial past.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Paga Crocodile Pond",
    "city": "Paga",
    "type": "nature",
    "description": "A unique site where visitors can interact with and feed crocodiles. The pond is culturally significant and offers a memorable experience of local traditions.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Mole National Park",
    "city": "Damongo",
    "type": "nature",
    "description": "Ghana's largest wildlife park, home to elephants and various mammals, offers safaris and walking tours. It’s a fantastic destination for wildlife enthusiasts.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "The Arts Centre for National Culture",
    "city": "Accra",
    "type": "culture",
    "description": "A vibrant hub for local arts, crafts, and culture. Visitors can purchase handmade goods and enjoy performances while learning about Ghanaian traditions.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Amedzofe",
    "city": "Ho",
    "type": "nature",
    "description": "Known for its stunning mountain views, Amedzofe is the highest inhabited village in Ghana. It offers hiking trails to the nearby Afadjato Mountain.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Abidjan",
    "city": "Accra",
    "type": "entertainment",
    "description": "A lively area known for its nightlife and entertainment options, including bars, clubs, and live music venues. It's a great place to experience the vibrant city life.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Kintampo Waterfalls",
    "city": "Kintampo",
    "type": "nature",
    "description": "One of the most beautiful waterfalls in Ghana, Kintampo Waterfalls features multiple cascades and lush surroundings. It's a popular spot for picnicking and swimming.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "The National Museum of Ghana",
    "city": "Accra",
    "type": "culture",
    "description": "This museum showcases Ghana's rich history and cultural heritage with exhibitions on art, archaeology, and ethnography. It’s a great educational stop for visitors.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Okomfo Anokye Sword",
    "city": "Kumasi",
    "type": "landmark",
    "description": "A significant historical site where the legendary priest Okomfo Anokye is said to have planted a sword into the ground, symbolizing the unity of the Ashanti people.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Boti Waterfalls",
    "city": "Akosombo",
    "type": "nature",
    "description": "Boti Waterfalls is known for its twin falls and stunning scenery. The area is perfect for hiking and enjoying nature, and it offers a serene escape.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Nubuke Foundation",
    "city": "Accra",
    "type": "culture",
    "description": "An art gallery and cultural space that promotes contemporary art and artists in Ghana. It hosts exhibitions, workshops, and community events.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Kakum Canopy Walkway",
    "city": "Abrafo",
    "type": "nature",
    "description": "One of the few canopy walkways in Africa, it offers a thrilling experience high above the forest floor, providing breathtaking views of the surrounding rainforest.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Akwamu Palace",
    "city": "Akosombo",
    "type": "landmark",
    "description": "The historic palace of the Akwamu people, it reflects the rich history and culture of the Akwamu Kingdom. Visitors can learn about the royal lineage and local traditions.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Boabeng-Fiema Monkey Sanctuary",
    "city": "Boabeng",
    "type": "nature",
    "description": "A community-driven sanctuary that protects the sacred Mona monkeys. It's a unique place to learn about conservation and interact with these friendly creatures.",
    "country": "Ghana",
    "country_rank": 4
  },
  {
    "name": "Ntonso Adinkra Cloth Village",
    "city": "Kumasi",
    "type": "culture",
    "description": "Known for its traditional Adinkra cloth, visitors can witness the dyeing process and purchase unique, handcrafted textiles that carry deep cultural meanings.",
    "country": "Ghana",
    "country_rank": 4
  }
]
