[
  {
    "name": "Red Square",
    "city": "Moscow",
    "type": "landmark",
    "description": "Red Square is the heart of Moscow and features historic buildings like the Kremlin and St. Basil's Cathedral. It's a UNESCO World Heritage site filled with rich history and vibrant culture.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Lake Baikal",
    "city": "Irkutsk",
    "type": "nature",
    "description": "Lake Baikal is the deepest and oldest freshwater lake in the world, known for its stunning beauty and unique biodiversity. Surrounded by mountains, it offers a tranquil escape and opportunities for adventure.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Hermitage Museum",
    "city": "St. Petersburg",
    "type": "culture",
    "description": "The Hermitage Museum is one of the largest and oldest museums in the world, housing a vast collection of art, including works by Rembrandt and Da Vinci. Its stunning architecture and rich history make it a must-visit.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Kremlin",
    "city": "Moscow",
    "type": "landmark",
    "description": "The Moscow Kremlin is a fortified complex that includes palaces, cathedrals, and the official residence of the President of Russia. Its historical significance and impressive architecture attract millions of visitors.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Kamchatka Peninsula",
    "city": "Petropavlovsk-Kamchatsky",
    "type": "nature",
    "description": "Famous for its stunning volcanic landscapes and diverse wildlife, Kamchatka is a paradise for nature lovers and adventure seekers. It's a UNESCO World Heritage site with breathtaking scenery.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Trans-Siberian Railway",
    "city": "Various",
    "type": "entertainment",
    "description": "The Trans-Siberian Railway is the longest railway line in the world, offering an unforgettable journey across Russia's vast landscapes. Travelers can experience diverse cultures and breathtaking views.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Peterhof Palace",
    "city": "St. Petersburg",
    "type": "landmark",
    "description": "Known as the 'Russian Versailles', Peterhof Palace is famous for its stunning gardens, fountains, and opulent architecture. It's a UNESCO World Heritage site and a symbol of Russian imperial grandeur.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Vladivostok",
    "city": "Vladivostok",
    "type": "culture",
    "description": "Vladivostok is a vibrant port city with a rich maritime history and stunning coastal views. It's a gateway to Asia and offers a unique blend of Russian and Asian cultures.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Sochi",
    "city": "Sochi",
    "type": "entertainment",
    "description": "Known for its subtropical climate and beautiful beaches, Sochi is a popular resort destination. It gained international attention as the host city for the 2014 Winter Olympics.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Kizhi Island",
    "city": "Kizhi",
    "type": "landmark",
    "description": "Kizhi Island is home to a UNESCO World Heritage site featuring stunning wooden architecture, including the iconic Church of the Transfiguration. It showcases traditional Russian wooden construction techniques.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Altai Mountains",
    "city": "Gorno-Altaisk",
    "type": "nature",
    "description": "The Altai Mountains offer stunning landscapes with mountains, rivers, and diverse flora and fauna. It's a perfect destination for hiking, camping, and immersing oneself in nature.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Novgorod Kremlin",
    "city": "Veliky Novgorod",
    "type": "landmark",
    "description": "The Novgorod Kremlin is one of the oldest and most significant historical sites in Russia, representing the birthplace of Russian democracy. Its impressive architecture and rich history attract history enthusiasts.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Baikal Ice Festival",
    "city": "Listvyanka",
    "type": "entertainment",
    "description": "Held annually, the Baikal Ice Festival celebrates the beauty of Lake Baikal during winter with ice sculptures, sports events, and cultural performances. It's a unique experience in an enchanting setting.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Suzdal",
    "city": "Suzdal",
    "type": "culture",
    "description": "Suzdal is a charming town known for its well-preserved medieval architecture and picturesque landscapes. It's a UNESCO World Heritage site and a great place to experience traditional Russian culture.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Golden Ring",
    "city": "Various",
    "type": "culture",
    "description": "The Golden Ring is a group of historic cities northeast of Moscow, known for their ancient architecture, monasteries, and rich cultural heritage. It's an excellent way to explore Russia's history.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "St. Isaac's Cathedral",
    "city": "St. Petersburg",
    "type": "landmark",
    "description": "St. Isaac's Cathedral is one of the largest cathedrals in the world, known for its impressive dome and stunning interior. Visitors can climb to the dome for panoramic views of the city.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Mount Elbrus",
    "city": "Terskol",
    "type": "nature",
    "description": "As the highest peak in Europe, Mount Elbrus is a popular destination for climbers and adventure seekers. Its breathtaking views and challenging trails attract outdoor enthusiasts year-round.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Ural Mountains",
    "city": "Yekaterinburg",
    "type": "nature",
    "description": "The Ural Mountains are known for their diverse landscapes, rich mineral resources, and cultural significance as a natural border between Europe and Asia. It's a great destination for hiking and nature exploration.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Moscow Metro",
    "city": "Moscow",
    "type": "entertainment",
    "description": "The Moscow Metro is famous for its ornate stations, combining functionality with stunning architecture. It's considered one of the most beautiful metro systems in the world.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "The Valley of Geysers",
    "city": "Kamchatka",
    "type": "nature",
    "description": "This unique geothermal area features more than 20 geysers and hot springs, making it one of the most significant geothermal fields in the world. It's a hidden gem for nature lovers.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Solovetsky Islands",
    "city": "Solovetsky",
    "type": "culture",
    "description": "The Solovetsky Islands are home to a historic monastery and a UNESCO World Heritage site. Known for its beautiful landscapes and rich history, it's a tranquil place for reflection.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Karelia",
    "city": "Petrozavodsk",
    "type": "nature",
    "description": "Karelia is known for its stunning lakes, forests, and unique cultural heritage. It's a great destination for outdoor activities like hiking, canoeing, and exploring traditional wooden architecture.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "The Church of the Savior on Spilled Blood",
    "city": "St. Petersburg",
    "type": "landmark",
    "description": "This colorful cathedral, built on the site of Emperor Alexander II's assassination, is famous for its ornate mosaics and distinctive architecture. It's a symbol of St. Petersburg's rich history.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Vladimir Golden Gate",
    "city": "Vladimir",
    "type": "landmark",
    "description": "The Golden Gate in Vladimir is a historic structure and a symbol of the city, showcasing ancient Russian architecture. It offers insights into the region's rich history.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Teriberka",
    "city": "Teriberka",
    "type": "nature",
    "description": "Teriberka is a remote fishing village on the coast of the Barents Sea, famous for its stunning landscapes and as a filming location for the movie 'Leviathan.' It's a hidden gem for adventure seekers.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Kola Peninsula",
    "city": "Murmansk",
    "type": "nature",
    "description": "The Kola Peninsula offers breathtaking landscapes, including the northern lights and unique wildlife. It's a great destination for those seeking unspoiled nature and outdoor adventures.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Rostov Veliky",
    "city": "Rostov Veliky",
    "type": "culture",
    "description": "Rostov Veliky is one of the oldest cities in Russia, known for its beautiful kremlin and traditional crafts. The town offers a glimpse into Russia's rich history and culture.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Sikhote-Alin Biosphere Reserve",
    "city": "Primorsky Krai",
    "type": "nature",
    "description": "This UNESCO Biosphere Reserve is home to diverse ecosystems and endangered species, including the Amur tiger. It's a unique destination for wildlife enthusiasts and nature lovers.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Khabarovsk",
    "city": "Khabarovsk",
    "type": "culture",
    "description": "Khabarovsk is a vibrant city located at the confluence of the Amur and Ussuri rivers. It boasts beautiful parks, cultural institutions, and a rich history, making it a unique destination in the Russian Far East.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Nizhny Novgorod Kremlin",
    "city": "Nizhny Novgorod",
    "type": "landmark",
    "description": "The Nizhny Novgorod Kremlin is a historical fortress with impressive walls and towers. It offers stunning views of the confluence of the Volga and Oka rivers and is a significant cultural site.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Dersu Uzala's House",
    "city": "Khabarovsk",
    "type": "culture",
    "description": "This museum is dedicated to the famous Ainu hunter Dersu Uzala, showcasing the indigenous culture and history of the region. It's a unique cultural experience for visitors.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Zelenogorsk",
    "city": "Zelenogorsk",
    "type": "nature",
    "description": "Zelenogorsk is a charming resort town by the Gulf of Finland, known for its beautiful beaches and forested landscapes. It's a perfect getaway for those seeking relaxation and nature.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Bolshoi Theatre",
    "city": "Moscow",
    "type": "entertainment",
    "description": "The Bolshoi Theatre is one of the world's most renowned opera and ballet theaters, known for its grand performances and stunning architecture. It's a cultural landmark in Russia.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Baikal-Lena Nature Reserve",
    "city": "Irkutsk",
    "type": "nature",
    "description": "This vast nature reserve combines stunning landscapes with rich biodiversity, making it a haven for outdoor enthusiasts and wildlife lovers. It's a lesser-known gem in Siberia.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Kazan Kremlin",
    "city": "Kazan",
    "type": "landmark",
    "description": "The Kazan Kremlin is a UNESCO World Heritage site, showcasing a unique blend of Tatar and Russian cultures. Its stunning architecture and historical significance make it a must-visit.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "The Seven Wonders of Russia",
    "city": "Various",
    "type": "culture",
    "description": "This initiative highlights Russia's most beautiful and culturally significant sites, from ancient monasteries to modern architectural marvels. It's a unique way to explore the country's diverse heritage.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "The Lena Pillars",
    "city": "Lena River",
    "type": "nature",
    "description": "The Lena Pillars are stunning natural rock formations along the Lena River, known for their breathtaking beauty and unique geology. It's a hidden gem for nature lovers and adventurers.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Chukotka Autonomous Okrug",
    "city": "Anadyr",
    "type": "nature",
    "description": "Chukotka is Russia's most northeastern region, famous for its remote landscapes, indigenous cultures, and opportunities to see the northern lights. It's an off-the-beaten-path destination.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Krasnaya Polyana",
    "city": "Sochi",
    "type": "entertainment",
    "description": "Krasnaya Polyana is a popular ski resort that gained prominence during the 2014 Winter Olympics. It offers year-round outdoor activities and stunning mountain scenery.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Mamayev Kurgan",
    "city": "Volgograd",
    "type": "landmark",
    "description": "Mamayev Kurgan is a monumental complex commemorating the Battle of Stalingrad, featuring the iconic Motherland Calls statue. It's a powerful symbol of resilience and history.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "The Golden Ring of Russia",
    "city": "Various",
    "type": "culture",
    "description": "The Golden Ring is a collection of historic cities showcasing ancient architecture, monasteries, and Russian culture. It offers a glimpse into the country's rich heritage and traditions.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Taman Peninsula",
    "city": "Krasnodar Krai",
    "type": "nature",
    "description": "The Taman Peninsula is known for its beautiful beaches, archaeological sites, and unique landscapes. It's a great destination for those looking to explore Russia's coastal beauty.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Samara Space Museum",
    "city": "Samara",
    "type": "culture",
    "description": "The Samara Space Museum showcases Russia's achievements in space exploration, with exhibits on spacecraft, satellites, and astronauts. It's a fascinating destination for space enthusiasts.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Astrakhan Kremlin",
    "city": "Astrakhan",
    "type": "landmark",
    "description": "The Astrakhan Kremlin is a historical fortress with beautiful architecture and rich history, located on the banks of the Volga River. It's a lesser-known gem with a unique cultural heritage.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Komsomolsk-on-Amur",
    "city": "Komsomolsk-on-Amur",
    "type": "culture",
    "description": "Komsomolsk-on-Amur is known for its aviation and shipbuilding industries, featuring unique museums and cultural sites. It's an interesting destination to explore Russia's industrial heritage.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Vyborg Castle",
    "city": "Vyborg",
    "type": "landmark",
    "description": "Vyborg Castle is a medieval fortress that reflects the city's rich history and diverse cultural influences. Its picturesque location and historical significance make it a fascinating site to visit.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Siberian Taiga",
    "city": "Various",
    "type": "nature",
    "description": "The Siberian Taiga is one of the largest forested areas in the world, offering stunning landscapes and diverse wildlife. It's a remote and tranquil destination for nature lovers.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Valley of the Geysers",
    "city": "Kamchatka",
    "type": "nature",
    "description": "The Valley of the Geysers is a geothermal wonderland featuring a unique collection of geysers and hot springs. It's one of the most significant geothermal fields in the world.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Tobolsk Kremlin",
    "city": "Tobolsk",
    "type": "landmark",
    "description": "The Tobolsk Kremlin is the only stone kremlin in Siberia, showcasing stunning architecture and a rich history. It's a unique cultural site and a symbol of Siberian heritage.",
    "country": "Russia",
    "country_rank": 7
  },
  {
    "name": "Karelia's Wooden Architecture",
    "city": "Karelia",
    "type": "culture",
    "description": "Karelia is famous for its traditional wooden architecture, including charming houses and churches. It's a cultural treasure trove that reflects Russia's rural heritage.",
    "country": "Russia",
    "country_rank": 7
  }
]
