[
  {
    "name": "Kpalimé",
    "city": "Kpalimé",
    "type": "nature",
    "description": "Nestled in the lush hills of Togo, Kpalimé is known for its stunning waterfalls and vibrant landscapes. It's a hub for hiking and exploring the nearby Mount Kloto, offering breathtaking views and experiences in nature.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Togoville",
    "city": "Togoville",
    "type": "culture",
    "description": "A historic town on the shores of Lake Togo, Togoville is rich in culture and tradition. It is known for its Vodoun practices and the annual celebration of the 'Fête de la Mer,' highlighting the local heritage.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Aklakou",
    "city": "Aklakou",
    "type": "nature",
    "description": "Aklakou is a serene destination famous for its picturesque landscapes and traditional villages. Visitors can enjoy hiking through the lush greenery and experiencing the local culture firsthand.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Lomé Grand Market",
    "city": "Lomé",
    "type": "culture",
    "description": "The Grand Market of Lomé is a vibrant place filled with colorful textiles, local crafts, and fresh produce. It's a great spot for experiencing the daily life of Togolese people and picking up unique souvenirs.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Fazao-Malfakassa National Park",
    "city": "Togoville",
    "type": "nature",
    "description": "This national park is a hidden gem in Togo, showcasing diverse flora and fauna. It's perfect for nature lovers and adventure seekers, offering opportunities for hiking and wildlife watching.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Koutammakou",
    "city": "Koutammakou",
    "type": "culture",
    "description": "Koutammakou is a UNESCO World Heritage site and the home of the Batammariba people, known for their distinctive mud tower houses called 'tatas.' Visitors can immerse themselves in the local culture and traditions.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Akossombo Dam",
    "city": "Aneho",
    "type": "landmark",
    "description": "The Akossombo Dam is an engineering marvel that provides hydroelectric power to Togo. It's located near the Volta River and offers stunning views, making it a popular spot for photography.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Ouidah",
    "city": "Ouidah",
    "type": "culture",
    "description": "Ouidah is steeped in history as a former slave trade port. Visitors can explore the Route of Slaves, the Temple of Pythons, and the vibrant local markets, which reflect the rich cultural heritage of the region.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Lake Togo",
    "city": "Lomé",
    "type": "nature",
    "description": "Lake Togo is a tranquil escape offering opportunities for boating and fishing. The surrounding area is dotted with charming villages where visitors can experience the local way of life.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Tafi Atome",
    "city": "Tafi Atome",
    "type": "nature",
    "description": "This village is known for its conservation efforts for the endangered Mona monkeys. It's a unique spot where visitors can engage with wildlife while enjoying beautiful natural surroundings.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Bafilo",
    "city": "Bafilo",
    "type": "culture",
    "description": "Bafilo is known for its rich traditions and vibrant festivals. The town is a great place to experience local crafts, music, and the warm hospitality of the Togolese people.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Kpalimé Handicrafts Market",
    "city": "Kpalimé",
    "type": "culture",
    "description": "This market is famous for its handcrafted goods, including textiles, jewelry, and wood carvings. It's a perfect spot to find unique souvenirs and support local artisans.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Mount Kloto",
    "city": "Kpalimé",
    "type": "nature",
    "description": "Mount Kloto offers breathtaking panoramic views and is a popular hiking destination. The lush forests and diverse wildlife make it a must-visit for nature enthusiasts.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Les Lacs de Togoville",
    "city": "Togoville",
    "type": "nature",
    "description": "The Lakes of Togoville provide a serene environment for relaxation and bird watching. It's a hidden gem where visitors can connect with nature and enjoy peace away from the hustle of city life.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Aného",
    "city": "Aného",
    "type": "culture",
    "description": "Aného is a coastal town with a rich history and beautiful beaches. It's known for its colonial architecture, vibrant markets, and the celebration of traditional festivals.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Kpalimé Waterfalls",
    "city": "Kpalimé",
    "type": "nature",
    "description": "The Kpalimé Waterfalls are a stunning natural attraction, perfect for swimming and picnicking. The scenic beauty of the area draws visitors looking for adventure and relaxation.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Palace of the King of Togo",
    "city": "Lomé",
    "type": "landmark",
    "description": "This historical palace is a symbol of Togolese royalty and heritage. Although not open to the public, its impressive architecture and cultural significance make it an interesting landmark to view from the outside.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Bafilo Waterfalls",
    "city": "Bafilo",
    "type": "nature",
    "description": "The Bafilo Waterfalls are a stunning, lesser-known natural wonder. Surrounded by lush greenery, they provide a peaceful retreat for those looking to explore Togo's natural beauty.",
    "country": "Togo",
    "country_rank": 2
  },
  {
    "name": "Togo National Museum",
    "city": "Lomé",
    "type": "culture",
    "description": "This museum showcases Togo's rich cultural heritage through various artifacts, art, and historical exhibits. It's an essential stop for those looking to understand the country's history and traditions.",
    "country": "Togo",
    "country_rank": 2
  }
]
