[
  {
    "name": "São Tomé",
    "city": "São Tomé",
    "type": "culture",
    "description": "The capital city offers a blend of colonial architecture, vibrant markets, and rich history. Visitors can explore the local culture through its music, art, and culinary delights.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Principe Island",
    "city": "Principe",
    "type": "nature",
    "description": "This UNESCO Biosphere Reserve is known for its pristine beaches, lush rainforests, and diverse wildlife. It's a perfect escape for nature lovers and those looking for tranquility.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Obo National Park",
    "city": "São Tomé",
    "type": "nature",
    "description": "A stunning national park that features lush rainforests, rivers, and waterfalls. It’s home to unique wildlife and offers hiking trails for adventure seekers.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Ribeira Iye",
    "city": "São Tomé",
    "type": "nature",
    "description": "A hidden gem with beautiful waterfalls and serene natural pools, perfect for a refreshing swim. It's a great spot for picnics and enjoying nature.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Ilha das Rolas",
    "city": "Ilha das Rolas",
    "type": "nature",
    "description": "This small island is located on the equator and features stunning beaches and clear waters. It’s a great place for snorkeling and relaxing away from the crowds.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "São Sebastião Fort",
    "city": "São Tomé",
    "type": "landmark",
    "description": "A historic fort built in the 16th century, offering stunning views of the sea and the city. It’s an important part of the island's colonial history.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Cascata de São Nicolau",
    "city": "São Tomé",
    "type": "nature",
    "description": "A breathtaking waterfall surrounded by lush vegetation, perfect for photography and nature walks. The sound of the cascading water is truly enchanting.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Roça Monte Café",
    "city": "São Tomé",
    "type": "culture",
    "description": "A former cocoa plantation that now serves as a cultural site where visitors can learn about the history of cocoa production in São Tomé and sample local chocolate.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Praia Jale",
    "city": "Principe",
    "type": "nature",
    "description": "A secluded beach known for its golden sands and clear waters, ideal for sunbathing and swimming. It's less crowded, providing a peaceful retreat.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Pico Cao Grande",
    "city": "Principe",
    "type": "nature",
    "description": "A striking volcanic plug that rises dramatically from the landscape, offering hiking opportunities and breathtaking views. It's a must-see for adventure enthusiasts.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "São Tomé Botanical Garden",
    "city": "São Tomé",
    "type": "nature",
    "description": "Home to a variety of tropical plants and trees, this garden is a peaceful place to explore and learn about the island’s flora. It’s perfect for leisurely walks.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Baía das Agulhas",
    "city": "Principe",
    "type": "nature",
    "description": "A picturesque bay known for its dramatic cliffs and stunning ocean views. It's an excellent spot for photography and enjoying the sunset.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Church of São João",
    "city": "São Tomé",
    "type": "culture",
    "description": "An architectural gem with beautiful stained glass windows and a rich history. It reflects the colonial past and religious traditions of the island.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Canoe Tour in Praia da Concha",
    "city": "Principe",
    "type": "entertainment",
    "description": "Experience the beauty of the coastline and marine life through a guided canoe tour. It's a fun way to explore hidden coves and enjoy the ocean.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Pico de São Tomé",
    "city": "São Tomé",
    "type": "nature",
    "description": "The highest peak in São Tomé, offering challenging hiking trails and panoramic views of the island. It’s a rewarding adventure for experienced hikers.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Roça São João",
    "city": "Principe",
    "type": "culture",
    "description": "A restored plantation that tells the story of the island’s agricultural history. Visitors can see the traditional methods of growing cocoa and coffee.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Tchiloli Theatre",
    "city": "São Tomé",
    "type": "culture",
    "description": "A unique cultural performance that combines music, dance, and drama, reflecting the island's history and traditions. Attending a performance is a must for cultural enthusiasts.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Praia do Mico",
    "city": "Principe",
    "type": "nature",
    "description": "A tranquil beach known for its clear waters and abundant marine life, making it ideal for snorkeling and swimming. It's a perfect spot for a relaxing day.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Cabo Verde Lighthouse",
    "city": "São Tomé",
    "type": "landmark",
    "description": "An iconic lighthouse that stands as a beacon for sailors, offering stunning coastal views. It's a popular spot for photography and enjoying the ocean breeze.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Cascata de São Miguel",
    "city": "São Tomé",
    "type": "nature",
    "description": "A beautiful waterfall located in a lush green setting, perfect for a refreshing swim and a picnic. It's a lesser-known spot that offers tranquility and natural beauty.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Roça da Praia",
    "city": "São Tomé",
    "type": "culture",
    "description": "An old cocoa plantation that has been partially restored, offering insights into the island's agricultural heritage. Visitors can explore the old buildings and surrounding gardens.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Pérola do Atlântico",
    "city": "Principe",
    "type": "entertainment",
    "description": "A charming beach bar offering local drinks and snacks, perfect for relaxing after a day of exploration. It has a laid-back vibe with stunning ocean views.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Furnas do Encontro de Águas",
    "city": "São Tomé",
    "type": "nature",
    "description": "A unique natural phenomenon where two rivers meet yet do not mix, creating a striking visual contrast. It's a fascinating site for nature lovers.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Café Cacau",
    "city": "São Tomé",
    "type": "culture",
    "description": "A local café where visitors can taste the island's famous cocoa and chocolate products. It's a delightful experience for food lovers and chocoholics.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Cascata do Cão",
    "city": "Principe",
    "type": "nature",
    "description": "A hidden waterfall that offers a serene escape into nature, surrounded by lush vegetation. It’s a great spot for hiking and enjoying the beauty of the island.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Museu Nacional de São Tomé e Príncipe",
    "city": "São Tomé",
    "type": "culture",
    "description": "The national museum showcases the rich history and culture of São Tomé and Príncipe through artifacts, photographs, and exhibitions.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  },
  {
    "name": "Ilhéu das Rolas",
    "city": "Ilhéu das Rolas",
    "type": "nature",
    "description": "A small, picturesque island known for its stunning beaches and rich biodiversity. It's a peaceful spot for snorkeling and enjoying nature.",
    "country": "Sao Tome and Principe",
    "country_rank": 3
  }
]
