[
  {
    "name": "Leptis Magna",
    "city": "Leptis Magna",
    "type": "landmark",
    "description": "One of the best-preserved Roman ruins in the Mediterranean, Leptis Magna boasts impressive structures like the Severan Basilica and the stunning Arch of Septimius Severus. The site offers a glimpse into the grandeur of ancient Roman architecture and urban planning.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Sabratha",
    "city": "Sabratha",
    "type": "landmark",
    "description": "Famous for its well-preserved Roman theater, Sabratha is a UNESCO World Heritage Site that showcases the rich history of Roman Libya. The ruins are set against a backdrop of the Mediterranean Sea, making it a picturesque destination.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Ghadames",
    "city": "Ghadames",
    "type": "culture",
    "description": "Known as the 'Pearl of the Desert', Ghadames is an ancient oasis town with stunning mud-brick architecture and a rich Berber culture. Its labyrinthine streets and traditional shaded roofs provide a unique glimpse into desert life.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Cyrene",
    "city": "Shahat",
    "type": "landmark",
    "description": "An ancient Greek city, Cyrene features impressive ruins including temples and a large amphitheater. The site is perched on a plateau overlooking the Mediterranean, offering breathtaking views and a deep sense of history.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "The Desert of Acacus",
    "city": "Wadi al-Hayat",
    "type": "nature",
    "description": "A UNESCO World Heritage Site, the Acacus Mountains are renowned for their stunning rock formations and prehistoric rock art. The remote desert landscape is perfect for adventurous travelers seeking natural beauty and ancient history.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Benghazi's Old Town",
    "city": "Benghazi",
    "type": "culture",
    "description": "The old town of Benghazi is rich in history with its charming architecture and vibrant markets. Visitors can explore traditional shops, enjoy local cuisine, and immerse themselves in the lively atmosphere of this coastal city.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Jebel Akhdar",
    "city": "Green Mountain Region",
    "type": "nature",
    "description": "Known as the 'Green Mountain', Jebel Akhdar is characterized by its lush landscapes and agricultural terraces. The area offers stunning hiking trails and a cooler climate, making it a refreshing escape from the desert heat.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Tadrart Acacus",
    "city": "Wadi al-Hayat",
    "type": "nature",
    "description": "This stunning mountain range features dramatic sandstone cliffs, unique rock formations, and ancient petroglyphs. It's a paradise for hiking and photography, offering a glimpse into both natural beauty and prehistoric human activity.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Qasr al-Haj",
    "city": "Near Ghadames",
    "type": "landmark",
    "description": "An ancient fortress that reflects the architectural style of the region, Qasr al-Haj is a lesser-known site that offers insight into the desert's historical defense systems. The fortress is surrounded by stunning desert landscapes.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Roman Theatre of Sabratha",
    "city": "Sabratha",
    "type": "landmark",
    "description": "This beautifully preserved Roman theater is one of the finest examples of ancient architecture in Libya. It still hosts performances and events, allowing visitors to experience a piece of history in a lively setting.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Al-Awinat Mountains",
    "city": "Near the Libyan-Egyptian border",
    "type": "nature",
    "description": "A remote mountain range offering stunning landscapes and opportunities for exploration and adventure. The area is less frequented by tourists, making it a hidden gem for those seeking solitude and natural beauty.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Sidi Abdul Rahman",
    "city": "Tripoli",
    "type": "entertainment",
    "description": "A lively beach area near Tripoli, Sidi Abdul Rahman is popular for its cafes and restaurants. It's a great spot to relax by the sea and enjoy local seafood while experiencing the vibrant atmosphere of Libyan coastal life.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "The Arch of Marcus Aurelius",
    "city": "Tripoli",
    "type": "landmark",
    "description": "This triumphal arch is a significant Roman monument in Tripoli, showcasing intricate carvings and historical significance. It stands as a testament to the city's rich history and is a popular spot for photography.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Jifara Plain",
    "city": "Near Tripoli",
    "type": "nature",
    "description": "A fertile agricultural region known for its beautiful landscapes and olive groves. The Jifara Plain offers a peaceful escape and a chance to experience the rural side of Libya.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "The Great Man-Made River",
    "city": "Various Locations",
    "type": "landmark",
    "description": "Often referred to as the 'Eighth Wonder of the World', this engineering marvel supplies water to the desert regions of Libya. Visitors can learn about its significance and impact on the country's development.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Zliten",
    "city": "Zliten",
    "type": "culture",
    "description": "A city with a rich history and beautiful mosques, Zliten is less touristy but offers a glimpse into traditional Libyan culture. The local markets and crafts provide an authentic experience for visitors.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Umm al-Ma'aziz Oasis",
    "city": "Near Ghadames",
    "type": "nature",
    "description": "This serene oasis is a hidden gem where travelers can experience lush palm groves and tranquil waters. It's an ideal spot for relaxation and enjoying the natural beauty of the Libyan desert.",
    "country": "Libya",
    "country_rank": 2
  },
  {
    "name": "Al-Mergheb",
    "city": "Mergheb",
    "type": "culture",
    "description": "A charming town known for its traditional architecture and rich history. Al-Mergheb provides a unique cultural experience and a chance to explore local customs and traditions.",
    "country": "Libya",
    "country_rank": 2
  }
]
