[
  {
    "name": "Lisbon",
    "city": "Lisbon",
    "type": "culture",
    "description": "The capital city of Portugal, Lisbon is known for its vibrant neighborhoods, historic trams, and stunning viewpoints. The blend of traditional and contemporary culture makes it a must-visit.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Sintra",
    "city": "Sintra",
    "type": "landmark",
    "description": "A UNESCO World Heritage site, Sintra is famous for its romantic 19th-century architecture, including the colorful Pena Palace and the Moorish Castle, set against a backdrop of lush hills.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Porto",
    "city": "Porto",
    "type": "culture",
    "description": "Known for its port wine, Porto features picturesque riverside views and stunning azulejo-tiled buildings. The historic center is a UNESCO World Heritage site, filled with charm and character.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Dão Valley",
    "city": "Viseu",
    "type": "nature",
    "description": "This lesser-known wine region offers beautiful vineyards set against rolling hills. It's a serene escape for wine lovers and nature enthusiasts looking for tranquility.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Ria Formosa",
    "city": "Faro",
    "type": "nature",
    "description": "A stunning coastal lagoon and a protected area, Ria Formosa is home to diverse wildlife and beautiful beaches. It's perfect for birdwatching, kayaking, and enjoying nature.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Évora",
    "city": "Évora",
    "type": "culture",
    "description": "A UNESCO World Heritage city, Évora is rich in history with its Roman Temple, medieval streets, and the haunting Chapel of Bones. It offers a glimpse into Portugal's past.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Cascais",
    "city": "Cascais",
    "type": "entertainment",
    "description": "A charming coastal town, Cascais boasts beautiful beaches, a lively marina, and a relaxed atmosphere. It's perfect for a day of sun, dining, and shopping.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Douro Valley",
    "city": "Peso da Régua",
    "type": "nature",
    "description": "Famous for its terraced vineyards and scenic river views, the Douro Valley is a stunning region for wine tasting and exploring picturesque villages.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Obidos",
    "city": "Obidos",
    "type": "landmark",
    "description": "A medieval town surrounded by walls, Obidos is known for its charming streets, whitewashed houses, and the annual chocolate festival that attracts visitors from far and wide.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Nazare",
    "city": "Nazare",
    "type": "entertainment",
    "description": "Famous for its massive waves, Nazare is a surfer's paradise and a vibrant beach town. The stunning views from the cliff tops are equally impressive.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Madeira",
    "city": "Funchal",
    "type": "nature",
    "description": "An archipelago known for its stunning landscapes, Madeira offers lush mountains, beautiful levadas (irrigation channels), and a mild climate year-round.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Azores",
    "city": "Ponta Delgada",
    "type": "nature",
    "description": "This group of volcanic islands is known for its breathtaking landscapes, hot springs, and rich marine life. It's a paradise for outdoor enthusiasts and nature lovers.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Guimarães",
    "city": "Guimarães",
    "type": "culture",
    "description": "Often referred to as the birthplace of Portugal, Guimarães has a well-preserved medieval center. Its castle and palace are must-see landmarks.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Tavira",
    "city": "Tavira",
    "type": "culture",
    "description": "A picturesque town in the Algarve, Tavira is known for its charming architecture, Roman bridge, and beautiful beaches. It's less touristy, offering a more authentic experience.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Batalha Monastery",
    "city": "Batalha",
    "type": "landmark",
    "description": "A UNESCO World Heritage site, this stunning Gothic monastery was built to commemorate the Battle of Aljubarrota. Its intricate architecture and historical significance make it a must-visit.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Viana do Castelo",
    "city": "Viana do Castelo",
    "type": "culture",
    "description": "This coastal city is known for its beautiful architecture, including the Santa Luzia Sanctuary, and its rich cultural traditions, including the famous Romaria de Nossa Senhora da Agonia.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Serra da Estrela",
    "city": "Covilhã",
    "type": "nature",
    "description": "The highest mountain range in Portugal, Serra da Estrela offers stunning views, hiking trails, and opportunities for winter sports. It's a hidden gem for nature lovers.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Lagos",
    "city": "Lagos",
    "type": "entertainment",
    "description": "Known for its stunning beaches and vibrant nightlife, Lagos is a popular destination in the Algarve. The dramatic coastline features beautiful cliffs and sea caves.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Cabo da Roca",
    "city": "Colares",
    "type": "nature",
    "description": "The westernmost point of mainland Europe, Cabo da Roca offers breathtaking views of the Atlantic Ocean and dramatic cliffs. It's a popular spot for photographers and nature lovers.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Aveiro",
    "city": "Aveiro",
    "type": "culture",
    "description": "Often referred to as the 'Venice of Portugal,' Aveiro is famous for its canals, colorful boats, and Art Nouveau architecture. The local sweet treat, ovos moles, is a must-try.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Ponta da Piedade",
    "city": "Lagos",
    "type": "nature",
    "description": "This stunning coastline features dramatic cliffs, sea stacks, and hidden grottoes. It's perfect for kayaking, boat tours, and enjoying breathtaking sunsets.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Castelo de Óbidos",
    "city": "Óbidos",
    "type": "landmark",
    "description": "This medieval castle offers stunning views of the surrounding landscape and is surrounded by a charming town filled with narrow streets and quaint shops.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Monsanto",
    "city": "Idanha-a-Nova",
    "type": "culture",
    "description": "Known as the 'most Portuguese village in Portugal,' Monsanto is unique for its houses built into giant boulders. Its stunning views and ancient ruins attract visitors seeking something different.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Algarve Coast",
    "city": "Albufeira",
    "type": "nature",
    "description": "Famous for its stunning beaches and dramatic cliffs, the Algarve Coast offers a range of outdoor activities, from hiking to water sports, making it a paradise for nature enthusiasts.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Lamego",
    "city": "Lamego",
    "type": "culture",
    "description": "Known for its wine and the stunning Sanctuary of Nossa Senhora dos Remédios, Lamego features beautiful baroque architecture and a rich cultural history.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Peneda-Gerês National Park",
    "city": "Gerês",
    "type": "nature",
    "description": "Portugal's only national park, Peneda-Gerês offers stunning landscapes, diverse wildlife, and numerous hiking trails. It's a haven for outdoor enthusiasts.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Santiago de Compostela",
    "city": "Santiago de Compostela",
    "type": "culture",
    "description": "Though technically in Spain, this city is a significant pilgrimage site that many visit after walking the Portuguese Camino. The stunning cathedral is a highlight.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Conímbriga",
    "city": "Condeixa-a-Nova",
    "type": "landmark",
    "description": "One of the best-preserved Roman sites in Portugal, Conímbriga features impressive ruins, mosaics, and a fascinating museum showcasing Roman life.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Cascata do Arado",
    "city": "Geres",
    "type": "nature",
    "description": "This stunning waterfall is located in the heart of Peneda-Gerês National Park and offers a serene escape into nature, perfect for hiking and photography.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Cerveira",
    "city": "Vila Nova de Cerveira",
    "type": "culture",
    "description": "A quaint village known for its vibrant arts scene, Cerveira hosts an annual art biennial and features beautiful landscapes along the Minho River.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Costa Nova",
    "city": "Aveiro",
    "type": "entertainment",
    "description": "Famous for its colorful striped houses, Costa Nova is a lovely beach destination ideal for relaxing, dining, and enjoying fresh seafood.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Alentejo Region",
    "city": "Évora",
    "type": "nature",
    "description": "Known for its rolling hills, vineyards, and olive groves, the Alentejo Region is perfect for those looking to explore traditional Portuguese rural life.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Serra do Caldeirão",
    "city": "Tavira",
    "type": "nature",
    "description": "This mountain range in the Algarve offers stunning views, hiking trails, and a chance to experience the region's natural beauty away from the coast.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Quinta da Regaleira",
    "city": "Sintra",
    "type": "landmark",
    "description": "A UNESCO World Heritage site, this enchanting estate features a palace, gardens, and mysterious initiatory wells, reflecting the romanticism of the era.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Fátima",
    "city": "Fátima",
    "type": "culture",
    "description": "A significant pilgrimage site, Fátima is known for the Sanctuary of Our Lady of Fátima, where millions of visitors come to pay their respects.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Praia da Marinha",
    "city": "Lagoa",
    "type": "nature",
    "description": "Often cited as one of the most beautiful beaches in the world, Praia da Marinha features golden sands and crystal-clear waters, perfect for swimming and snorkeling.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Castelo de São Jorge",
    "city": "Lisbon",
    "type": "landmark",
    "description": "Overlooking the city, this historic castle offers panoramic views and a glimpse into Lisbon's past with its ancient walls and archaeological site.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Albufeira",
    "city": "Albufeira",
    "type": "entertainment",
    "description": "A popular tourist destination in the Algarve, Albufeira is known for its nightlife, stunning beaches, and vibrant atmosphere, making it perfect for a fun getaway.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Cascais Citadel",
    "city": "Cascais",
    "type": "landmark",
    "description": "This historic fortress offers a glimpse into Portugal's maritime history, with beautiful views of the coast and a charming atmosphere.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Marvão",
    "city": "Marvão",
    "type": "landmark",
    "description": "This hilltop village is known for its stunning castle and panoramic views of the surrounding countryside, offering a unique perspective on rural Portugal.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Pico do Arieiro",
    "city": "Madeira",
    "type": "nature",
    "description": "The third-highest peak in Madeira, Pico do Arieiro offers breathtaking views and challenging hiking trails, making it a favorite among outdoor enthusiasts.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Arrábida Natural Park",
    "city": "Setúbal",
    "type": "nature",
    "description": "This beautiful park features stunning landscapes, dramatic cliffs, and pristine beaches. It's ideal for hiking, birdwatching, and enjoying the natural beauty.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Ponte 25 de Abril",
    "city": "Lisbon",
    "type": "landmark",
    "description": "Often compared to San Francisco's Golden Gate Bridge, this suspension bridge offers stunning views of the Lisbon skyline and the Tagus River.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Vila Nova de Milfontes",
    "city": "Milfontes",
    "type": "nature",
    "description": "A charming coastal town known for its beautiful beaches and relaxed atmosphere, it's a hidden gem in the Alentejo region.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Capela dos Ossos",
    "city": "Évora",
    "type": "culture",
    "description": "This unique chapel, adorned with skulls and bones, serves as a reminder of the fragility of life and is a captivating sight for visitors.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Torre de Belém",
    "city": "Lisbon",
    "type": "landmark",
    "description": "A UNESCO World Heritage site, this iconic tower is a symbol of Portugal's Age of Discoveries and offers beautiful views of the Tagus River.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Póvoa de Varzim",
    "city": "Póvoa de Varzim",
    "type": "entertainment",
    "description": "A coastal town known for its beaches, casinos, and seafood restaurants, Póvoa de Varzim is a lively destination for tourists.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Serra da Arrábida",
    "city": "Setúbal",
    "type": "nature",
    "description": "This stunning mountain range features scenic views, hiking trails, and beautiful beaches, making it a hidden gem for nature lovers.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Almeirim",
    "city": "Almeirim",
    "type": "culture",
    "description": "Known for its rich culinary heritage, Almeirim is famous for its delicious soup and local wines, making it a delightful stop for food lovers.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Cascais Marina",
    "city": "Cascais",
    "type": "entertainment",
    "description": "This vibrant marina offers a range of activities, including sailing, dining, and shopping, all set against the backdrop of beautiful views.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Caminho Português de Santiago",
    "city": "Various",
    "type": "culture",
    "description": "This pilgrimage route leads travelers through picturesque landscapes, historic towns, and cultural experiences, culminating in Santiago de Compostela.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Castelo de Almourol",
    "city": "Torre de Barcas",
    "type": "landmark",
    "description": "Situated on an island in the Tagus River, this medieval castle is a stunning sight, accessible by boat and steeped in history.",
    "country": "Portugal",
    "country_rank": 9
  },
  {
    "name": "Caminho de Santiago",
    "city": "Various",
    "type": "culture",
    "description": "This historic pilgrimage route offers scenic beauty and cultural experiences, attracting hikers and spiritual seekers from around the world.",
    "country": "Portugal",
    "country_rank": 9
  }
]
