[
  {
    "name": "Antelope Canyon",
    "city": "Page",
    "type": "nature",
    "description": "A stunning slot canyon known for its wave-like structure and incredible light beams that shine through the narrow openings. It's a photographer's paradise and offers guided tours for exploring its mesmerizing formations.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Wave",
    "city": "Coyote Buttes",
    "type": "nature",
    "description": "A spectacular sandstone rock formation known for its undulating, colorful patterns. Access is limited, making it a hidden gem for those seeking a less crowded adventure.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Great Sand Dunes National Park",
    "city": "Mosca",
    "type": "nature",
    "description": "Home to the tallest sand dunes in North America, this park offers a unique landscape where visitors can hike, sandboard, and stargaze. Its diverse ecosystems, including alpine forests and wetlands, make it a fascinating destination.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Saguaro National Park",
    "city": "Tucson",
    "type": "nature",
    "description": "Famous for its iconic saguaro cacti, this park offers stunning desert landscapes and a variety of hiking trails. The park's unique flora and fauna provide excellent opportunities for wildlife viewing.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Devils Kettle",
    "city": "Judge C. R. Magney State Park",
    "type": "nature",
    "description": "A mysterious waterfall where one side flows into a hole and disappears without a trace. This natural wonder captivates visitors with its enigma and surrounding scenic beauty.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Carhenge",
    "city": "Alliance",
    "type": "landmark",
    "description": "A quirky replica of England's Stonehenge, constructed from vintage cars. This roadside attraction is a testament to creativity and humor, drawing visitors curious about its unique structure.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Hocking Hills",
    "city": "Logan",
    "type": "nature",
    "description": "Known for its breathtaking waterfalls, caves, and hiking trails, this area offers a serene escape into nature. The stunning landscapes and rich biodiversity make it a favorite for outdoor enthusiasts.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Bodie State Historic Park",
    "city": "Bodie",
    "type": "culture",
    "description": "A well-preserved ghost town that showcases the life of a mining community during the California Gold Rush. Visitors can explore the remains of buildings and learn about the town's fascinating history.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Chocolate Factory",
    "city": "Hershey",
    "type": "entertainment",
    "description": "Home to Hershey's Chocolate World, where visitors can learn about the chocolate-making process, enjoy interactive exhibits, and sample delicious treats. It's a sweet destination for families and chocolate lovers alike.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The City Museum",
    "city": "St. Louis",
    "type": "entertainment",
    "description": "An eclectic blend of playground, funhouse, and architectural marvel, this museum features repurposed industrial objects and whimsical installations. It's a place where creativity thrives and fun knows no age limit.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Chichen Itza",
    "city": "Yucatan",
    "type": "landmark",
    "description": "Though primarily located in Mexico, it's a popular destination for many American travelers. This ancient Mayan city is famed for its impressive pyramid and rich history, attracting visitors interested in archaeology.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Mount Rainier National Park",
    "city": "Ashford",
    "type": "nature",
    "description": "Home to the iconic Mount Rainier, this park offers stunning vistas, diverse wildlife, and abundant wildflowers. It's a must-visit for hikers and nature lovers seeking breathtaking scenery.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Salt Mines",
    "city": "Detroit",
    "type": "culture",
    "description": "An intriguing underground tour that showcases the history of salt mining in the area. Visitors can explore the tunnels and learn about the unique geology and history beneath Detroit.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Canyonlands National Park",
    "city": "Moab",
    "type": "nature",
    "description": "A vast expanse of rugged canyons and unique rock formations, offering stunning views and a variety of outdoor activities. Its remote beauty makes it a favorite for adventurers and photographers.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Alamo",
    "city": "San Antonio",
    "type": "landmark",
    "description": "A historic mission and the site of a pivotal battle in the Texas Revolution. Visitors can explore the grounds and learn about its significance in American history.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Haleakalā National Park",
    "city": "Kula",
    "type": "nature",
    "description": "Known for its stunning sunrise views from the summit, this park features diverse ecosystems, volcanic landscapes, and hiking trails. It's a breathtaking spot for nature lovers and adventurers.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Marfa Lights",
    "city": "Marfa",
    "type": "entertainment",
    "description": "An unexplained phenomenon where mysterious lights appear in the desert. This quirky attraction draws visitors intrigued by the supernatural and offers a unique experience under the starry Texas sky.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The House on the Rock",
    "city": "Spring Green",
    "type": "entertainment",
    "description": "An architectural marvel filled with eclectic collections and immersive exhibits. The house features bizarre rooms and stunning views, making it a unique experience for visitors.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The National Shrine of Our Lady of La Leche",
    "city": "St. Augustine",
    "type": "culture",
    "description": "A peaceful pilgrimage site with beautiful gardens and chapels, dedicated to the Virgin Mary. This serene location offers a glimpse into the spiritual history of the area.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Custer State Park",
    "city": "Custer",
    "type": "nature",
    "description": "Home to a diverse range of wildlife, including bison and burros, this park offers scenic drives and hiking trails. It's a perfect spot for outdoor adventures and nature appreciation.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Petrified Forest National Park",
    "city": "Holbrook",
    "type": "nature",
    "description": "Famous for its fossilized trees and colorful badlands, this park offers a unique glimpse into the ancient past. Visitors can hike trails and explore fascinating geological features.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Getty Center",
    "city": "Los Angeles",
    "type": "culture",
    "description": "A stunning art museum that showcases European paintings, sculptures, and decorative arts. The architecture and gardens provide a beautiful backdrop for art lovers and visitors.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The USS Arizona Memorial",
    "city": "Honolulu",
    "type": "landmark",
    "description": "A solemn tribute to the lives lost during the attack on Pearl Harbor. The memorial offers a poignant glimpse into history and honors the sacrifices made during World War II.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The National Mall",
    "city": "Washington, D.C.",
    "type": "landmark",
    "description": "A sprawling park that stretches from the Capitol to the Lincoln Memorial, lined with iconic monuments and memorials. It's a central hub for American history and culture.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Badlands",
    "city": "Interior",
    "type": "nature",
    "description": "Known for its dramatic landscapes and rich fossil beds, this national park features layered rock formations and diverse wildlife. It's a great place for hiking and photography.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Icefields Parkway",
    "city": "Jasper",
    "type": "nature",
    "description": "One of the most scenic drives in North America, this route offers breathtaking views of glaciers, lakes, and mountains. It's a must-visit for road trippers and nature enthusiasts.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Cumberland Island",
    "city": "St. Marys",
    "type": "nature",
    "description": "A secluded island known for its pristine beaches, wild horses, and historic ruins. It's a hidden gem for those seeking a peaceful retreat and natural beauty.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Wright Brothers National Memorial",
    "city": "Kill Devil Hills",
    "type": "landmark",
    "description": "Honoring the birthplace of aviation, this site commemorates the achievements of the Wright brothers. Visitors can explore exhibits and learn about their historic flights.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Point Reyes National Seashore",
    "city": "Point Reyes Station",
    "type": "nature",
    "description": "A rugged coastal area with stunning cliffs, diverse wildlife, and scenic hiking trails. It's a haven for nature lovers and offers breathtaking ocean views.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Skirball Cultural Center",
    "city": "Los Angeles",
    "type": "culture",
    "description": "A unique cultural institution that celebrates Jewish heritage and American democratic ideals. Its exhibitions and programs promote understanding and appreciation of diverse cultures.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "Sedona Red Rock Country",
    "city": "Sedona",
    "type": "nature",
    "description": "Famed for its striking red rock formations and vibrant art scene, this area offers stunning hiking trails and spiritual retreats. It's a popular destination for outdoor enthusiasts and those seeking tranquility.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Museum of Bad Art",
    "city": "Dedham",
    "type": "culture",
    "description": "Dedicated to the collection of bad art, this quirky museum showcases pieces that are unintentionally humorous. It's a light-hearted experience that celebrates the beauty of imperfection.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Crater of Diamonds State Park",
    "city": "Murfreesboro",
    "type": "entertainment",
    "description": "The only diamond-producing site in the world open to the public, where visitors can search for real diamonds. It's a unique and fun experience for treasure hunters and families.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "New River Gorge",
    "city": "Fayetteville",
    "type": "nature",
    "description": "A stunning natural area known for its whitewater rafting, rock climbing, and scenic views. It's a paradise for outdoor adventurers looking for thrill and beauty.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Ringling",
    "city": "Sarasota",
    "type": "culture",
    "description": "A museum complex featuring art, circus history, and beautiful gardens. It's a fascinating destination that celebrates the legacy of the Ringling Brothers.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The National World War II Museum",
    "city": "New Orleans",
    "type": "culture",
    "description": "An extensive museum dedicated to preserving the history of World War II. It features immersive exhibits and personal stories that bring history to life.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Oregon Coast",
    "city": "Various",
    "type": "nature",
    "description": "A breathtaking stretch of coastline with dramatic cliffs, sandy beaches, and charming towns. It's perfect for road trips and outdoor activities like hiking and beachcombing.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The San Juan Islands",
    "city": "Washington",
    "type": "nature",
    "description": "A picturesque archipelago known for its stunning landscapes and outdoor activities. It's an ideal destination for kayaking, whale watching, and exploring charming seaside towns.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Ghost Town of Bodie",
    "city": "Bodie",
    "type": "culture",
    "description": "A preserved ghost town that offers a glimpse into California's Gold Rush era. Visitors can explore the remnants of the town and learn about its fascinating history.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The National Air and Space Museum",
    "city": "Washington, D.C.",
    "type": "culture",
    "description": "Part of the Smithsonian Institution, this museum showcases the history of aviation and space exploration. It's home to iconic artifacts like the Wright brothers' plane and the Apollo 11 command module.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Black Hills",
    "city": "South Dakota",
    "type": "nature",
    "description": "A mountain range known for its stunning landscapes, unique rock formations, and rich Native American history. It's home to attractions like Mount Rushmore and Custer State Park.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Wave Organ",
    "city": "San Francisco",
    "type": "entertainment",
    "description": "An acoustic sculpture that uses the tides to create music. Located on the waterfront, it's a unique blend of art and nature that offers a soothing experience.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Blue Ridge Parkway",
    "city": "Virginia/North Carolina Border",
    "type": "nature",
    "description": "A scenic highway known for its breathtaking views of the Appalachian Mountains. It's a perfect destination for road trips, hiking, and enjoying the changing foliage.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Georgia Guidestones",
    "city": "Elberton",
    "type": "landmark",
    "description": "A mysterious granite monument featuring inscriptions in multiple languages. Often referred to as America's Stonehenge, it sparks curiosity and debate among visitors.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The USS Midway Museum",
    "city": "San Diego",
    "type": "culture",
    "description": "A maritime museum aboard the historic USS Midway aircraft carrier. Visitors can explore the ship and learn about naval aviation history.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Enchanted Highway",
    "city": "Regent",
    "type": "landmark",
    "description": "A quirky stretch of highway adorned with giant metal sculptures. It's a fun roadside attraction that celebrates the creativity of local artists.",
    "country": "United States",
    "country_rank": 9
  },
  {
    "name": "The Big Pine Key",
    "city": "Florida Keys",
    "type": "nature",
    "description": "A beautiful island in the Florida Keys known for its natural beauty and wildlife, including the endangered Key deer. It's perfect for outdoor activities like kayaking and snorkeling.",
    "country": "United States",
    "country_rank": 9
  }
]
