[
  {
    "name": "Angel Falls",
    "city": "Canaima National Park",
    "type": "nature",
    "description": "The world's highest uninterrupted waterfall, Angel Falls cascades from a height of 979 meters. Surrounded by lush rainforest and stunning tepuis, it is a breathtaking natural wonder that attracts adventurers and nature lovers.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Los Roques Archipelago",
    "city": "Los Roques",
    "type": "nature",
    "description": "A paradise of over 300 islands and cays, Los Roques boasts crystal-clear waters and white sandy beaches. It's a haven for snorkeling, windsurfing, and kite surfing, making it a perfect getaway for beach lovers.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Roraima",
    "city": "Gran Sabana",
    "type": "nature",
    "description": "This flat-topped mountain, or tepui, is one of the oldest geological formations on Earth. Roraima's unique ecosystem and stunning landscapes make it a popular trekking destination for those seeking adventure and natural beauty.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Mérida Cable Car",
    "city": "Mérida",
    "type": "entertainment",
    "description": "As one of the longest and highest cable cars in the world, the Mérida Cable Car offers spectacular views of the Andes mountains. It connects the city of Mérida to the Sierra Nevada National Park, perfect for outdoor enthusiasts.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Cayo de Agua",
    "city": "Los Roques",
    "type": "nature",
    "description": "A stunning remote island known for its pristine beaches and vibrant coral reefs, Cayo de Agua is ideal for those looking to escape the crowds. Its unspoiled beauty makes it a hidden gem in the Caribbean.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Cayo de Agua",
    "city": "Los Roques",
    "type": "nature",
    "description": "A stunning remote island known for its pristine beaches and vibrant coral reefs, Cayo de Agua is ideal for those looking to escape the crowds. Its unspoiled beauty makes it a hidden gem in the Caribbean.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Los Llanos",
    "city": "Apure",
    "type": "nature",
    "description": "This vast tropical savanna is home to diverse wildlife, including capybaras, anacondas, and a variety of bird species. Los Llanos offers unique opportunities for eco-tourism and wildlife viewing.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Ciudad Bolívar",
    "city": "Ciudad Bolívar",
    "type": "culture",
    "description": "The capital of Bolívar State, Ciudad Bolívar is known for its colonial architecture and vibrant culture. It's the gateway to Angel Falls and offers rich history and local markets.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Cayo Caracoles",
    "city": "Los Roques",
    "type": "nature",
    "description": "This picturesque island is famous for its stunning sandbanks and crystal-clear waters, perfect for snorkeling and relaxing. Cayo Caracoles is a lesser-known gem that offers serene beauty away from the more crowded spots.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Parque Nacional Morrocoy",
    "city": "Falcon",
    "type": "nature",
    "description": "A stunning national park with beautiful beaches and a rich marine ecosystem, Morrocoy is perfect for swimming, bird watching, and enjoying local seafood. Its idyllic cays and mangroves make it a favorite among locals.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "La Gran Sabana",
    "city": "Gran Sabana",
    "type": "nature",
    "description": "This breathtaking region features vast savannas, waterfalls, and unique rock formations. La Gran Sabana is known for its indigenous cultures and offers incredible trekking opportunities.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Catedral de Caracas",
    "city": "Caracas",
    "type": "landmark",
    "description": "The main cathedral of the capital city, this historic church showcases stunning architecture and beautiful art. It's a symbol of Caracas and a must-visit for history and architecture enthusiasts.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Los Iros",
    "city": "Choroni",
    "type": "nature",
    "description": "A beautiful beach located near the quaint fishing village of Choroni, Los Iros is surrounded by lush greenery and offers a serene atmosphere. It's a perfect spot for relaxation and enjoying the sunset.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Pico Bolívar",
    "city": "Mérida",
    "type": "nature",
    "description": "Venezuela's highest peak, Pico Bolívar, is a popular destination for climbers and hikers. The trek offers stunning views of the Andes and the surrounding landscapes.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Maracaibo Lake",
    "city": "Maracaibo",
    "type": "nature",
    "description": "This large lake is known for its unique ecosystem and the famous Catatumbo lightning phenomenon. It's a great spot for nature lovers and offers stunning sunsets.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "El Ávila National Park",
    "city": "Caracas",
    "type": "nature",
    "description": "This national park is located just outside Caracas and offers hiking trails, diverse flora and fauna, and stunning views of the city below. It's an oasis of nature in an urban setting.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Choroni",
    "city": "Aragua",
    "type": "culture",
    "description": "A charming coastal town known for its colonial architecture and vibrant culture, Choroni offers beautiful beaches and rich history. It's a favorite destination for travelers looking for authentic Venezuelan culture.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "La Isla de Margarita",
    "city": "Nueva Esparta",
    "type": "nature",
    "description": "Known for its stunning beaches and vibrant nightlife, Isla de Margarita is a popular tourist destination. It offers a mix of relaxation, water sports, and cultural experiences.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Salto Angel",
    "city": "Canaima",
    "type": "nature",
    "description": "Not to be confused with Angel Falls, this waterfall is another breathtaking sight in the region. Its stunning beauty and remote location make it a perfect spot for adventure seekers.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Cayo Sal",
    "city": "Los Roques",
    "type": "nature",
    "description": "A small, picturesque island known for its tranquil waters and stunning coral reefs. Cayo Sal is often less crowded, making it a perfect spot for relaxation and snorkeling.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Playa Medina",
    "city": "Cumaná",
    "type": "nature",
    "description": "This beautiful beach features soft sand and clear waters, surrounded by lush palm trees. Playa Medina is less commercialized, offering a peaceful escape for visitors.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Caracas Botanical Garden",
    "city": "Caracas",
    "type": "nature",
    "description": "A lush green space in the heart of the city, the Caracas Botanical Garden is home to diverse plant species and tranquil walking paths. It's a perfect spot for relaxation and enjoying nature.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Pueblo de Chacao",
    "city": "Caracas",
    "type": "culture",
    "description": "This charming neighborhood in Caracas boasts picturesque streets, vibrant street art, and local markets. It's a great area to explore Venezuelan culture and cuisine.",
    "country": "Venezuela",
    "country_rank": 3
  },
  {
    "name": "Los Medanos de Coro",
    "city": "Coro",
    "type": "nature",
    "description": "A UNESCO World Heritage site, these impressive dunes are a unique desert landscape. Visitors can explore the dunes and enjoy the stunning views of the surrounding area.",
    "country": "Venezuela",
    "country_rank": 3
  }
]
