[
  {
    "name": "Chichen Itza",
    "city": "Tinum",
    "type": "landmark",
    "description": "An ancient Mayan city and UNESCO World Heritage site, Chichen Itza is famous for its iconic pyramid, El Castillo, and its astronomical significance. Visitors can explore various temples and cenotes that showcase the architectural prowess of the Mayans.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Cenote Ik Kil",
    "city": "Chichen Itza",
    "type": "nature",
    "description": "A stunning natural sinkhole filled with crystal-clear water, Cenote Ik Kil is surrounded by lush vegetation and hanging vines. It's a popular spot for swimming and offers a unique opportunity to experience the natural beauty of the Yucatan Peninsula.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Teotihuacan",
    "city": "Teotihuacan",
    "type": "landmark",
    "description": "Once one of the largest cities in the ancient world, Teotihuacan features the impressive Pyramids of the Sun and Moon. The site provides insight into pre-Columbian life and architecture, making it a fascinating day trip from Mexico City.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Oaxaca de Juarez",
    "city": "Oaxaca",
    "type": "culture",
    "description": "Known for its vibrant arts and indigenous cultures, Oaxaca de Juarez offers a rich tapestry of traditions, handicrafts, and culinary delights. The annual Guelaguetza festival celebrates local heritage with music, dance, and colorful costumes.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Tulum Ruins",
    "city": "Tulum",
    "type": "landmark",
    "description": "Perched on a cliff overlooking the Caribbean Sea, the Tulum Ruins are among the best-preserved coastal Mayan ruins. The breathtaking views and well-preserved structures make it a must-visit for history buffs and beach lovers alike.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Sierra Gorda Biosphere Reserve",
    "city": "Querétaro",
    "type": "nature",
    "description": "A hidden gem of biodiversity, the Sierra Gorda Biosphere Reserve is home to stunning landscapes, diverse ecosystems, and several endangered species. Hiking, birdwatching, and eco-tourism are popular activities in this pristine natural area.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "San Miguel de Allende",
    "city": "San Miguel de Allende",
    "type": "culture",
    "description": "This charming colonial town is known for its cobblestone streets, vibrant arts scene, and stunning architecture. San Miguel de Allende hosts numerous festivals and has a thriving expatriate community, making it a cultural hub.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Copper Canyon",
    "city": "Chihuahua",
    "type": "nature",
    "description": "Larger and deeper than the Grand Canyon, Copper Canyon is a series of six canyons offering breathtaking views and outdoor adventures. Visitors can hike, bike, or take a scenic train ride through this stunning landscape.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Palenque",
    "city": "Palenque",
    "type": "landmark",
    "description": "An archaeological wonder, Palenque showcases the grandeur of ancient Mayan civilization with its impressive temples and intricate carvings. The site is nestled in lush jungle, adding to its mystique and beauty.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "La Paz",
    "city": "La Paz",
    "type": "nature",
    "description": "Known for its stunning beaches and marine life, La Paz offers opportunities for snorkeling, diving, and whale watching. The nearby Isla Espiritu Santo is a UNESCO Biosphere Reserve and a paradise for nature lovers.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Xilitla",
    "city": "San Luis Potosí",
    "type": "culture",
    "description": "Home to the surrealist garden of Edward James, Xilitla features whimsical sculptures and lush gardens that blend art with nature. This unique destination invites visitors to explore a magical landscape unlike any other.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Guanajuato",
    "city": "Guanajuato",
    "type": "culture",
    "description": "A UNESCO World Heritage site, Guanajuato is famous for its colorful alleys, underground tunnels, and rich history of silver mining. The city hosts the International Cervantino Festival, attracting artists and performers from around the world.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Isla Holbox",
    "city": "Holbox",
    "type": "nature",
    "description": "A tranquil island known for its pristine beaches and vibrant wildlife, Isla Holbox is a haven for birdwatchers and eco-tourists. The island's laid-back atmosphere and stunning sunsets make it a perfect getaway.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Hierve el Agua",
    "city": "Oaxaca",
    "type": "nature",
    "description": "Famous for its natural mineral springs and striking rock formations, Hierve el Agua resembles a frozen waterfall. Visitors can swim in the pools or hike the surrounding trails for spectacular views of the Oaxaca Valley.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Cozumel",
    "city": "Cozumel",
    "type": "nature",
    "description": "Renowned for its coral reefs, Cozumel is a top destination for diving and snorkeling enthusiasts. The island's crystal-clear waters and vibrant marine life make it a paradise for underwater exploration.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Puebla",
    "city": "Puebla",
    "type": "culture",
    "description": "Famed for its culinary heritage and Talavera pottery, Puebla is a colorful city with a rich colonial history. The stunning Puebla Cathedral and nearby Cholula pyramid are highlights of any visit.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Las Pozas",
    "city": "Xilitla",
    "type": "culture",
    "description": "A surreal garden created by Edward James, Las Pozas features intricate sculptures and towering structures set amidst a lush tropical landscape. The whimsical architecture and natural beauty create a dreamlike atmosphere.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Cascadas de Agua Azul",
    "city": "Chiapas",
    "type": "nature",
    "description": "These stunning waterfalls are known for their vibrant blue water and lush surroundings. Visitors can swim in the natural pools and hike the trails to enjoy the breathtaking scenery.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Bacalar Lagoon",
    "city": "Bacalar",
    "type": "nature",
    "description": "Known as the 'Lake of Seven Colors,' Bacalar Lagoon features stunning turquoise waters and a tranquil atmosphere. Kayaking and swimming in the lagoon are popular activities, making it a fantastic spot for relaxation.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Valle de Bravo",
    "city": "Valle de Bravo",
    "type": "nature",
    "description": "A picturesque town nestled by a lake, Valle de Bravo is perfect for outdoor activities like sailing, hiking, and mountain biking. The charming town center is filled with colonial architecture and vibrant local markets.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Catedral Metropolitana",
    "city": "Mexico City",
    "type": "landmark",
    "description": "This magnificent cathedral is a prime example of colonial architecture, blending Gothic and baroque styles. Located in the heart of Mexico City, it's a must-visit for history and architecture enthusiasts.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Tzintzuntzan",
    "city": "Michoacán",
    "type": "culture",
    "description": "Once the capital of the Purépecha Empire, Tzintzuntzan features ancient ruins and a serene lakeside setting. The archaeological site offers insight into the rich history of the region.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Playa del Carmen",
    "city": "Playa del Carmen",
    "type": "entertainment",
    "description": "A bustling beach town, Playa del Carmen offers vibrant nightlife, shopping, and dining along its famous 5th Avenue. The nearby beaches and cenotes provide opportunities for relaxation and adventure.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Cenote Dos Ojos",
    "city": "Tulum",
    "type": "nature",
    "description": "Known for its stunning crystal-clear waters, Cenote Dos Ojos is a popular spot for snorkeling and diving. The underwater cave system is one of the longest in the world, attracting adventurers and nature lovers.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Zacatecas",
    "city": "Zacatecas",
    "type": "culture",
    "description": "A UNESCO World Heritage site, Zacatecas is known for its rich mining history and stunning baroque architecture. The city's picturesque streets, museums, and vibrant cultural scene make it a delightful destination.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Cabo San Lucas",
    "city": "Cabo San Lucas",
    "type": "entertainment",
    "description": "Famous for its stunning beaches and vibrant nightlife, Cabo San Lucas is a popular resort destination. Visitors can enjoy water sports, whale watching, and explore the iconic El Arco rock formation.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Real de Catorce",
    "city": "San Luis Potosí",
    "type": "culture",
    "description": "A former silver mining town, Real de Catorce is now a charming ghost town with stunning views and rich history. Visitors can explore the old streets, churches, and enjoy the mystical atmosphere of this high-altitude destination.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Tepoztlán",
    "city": "Morelos",
    "type": "culture",
    "description": "Known for its mystical energy and stunning mountain scenery, Tepoztlán is home to a vibrant market and the ancient Tepozteco pyramid. The town's bohemian vibe and rich traditions attract visitors seeking a unique experience.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "Los Cabos Corridor",
    "city": "Los Cabos",
    "type": "nature",
    "description": "The scenic Los Cabos Corridor features stunning beaches, luxurious resorts, and breathtaking desert landscapes. This stretch of coastline offers numerous opportunities for relaxation, water sports, and exploration.",
    "country": "Mexico",
    "country_rank": 4
  },
  {
    "name": "El Tajin",
    "city": "Papantla",
    "type": "landmark",
    "description": "An archaeological site known for its impressive pyramids and unique architecture, El Tajin is a UNESCO World Heritage site. The annual Totonac festival celebrates the region's indigenous culture through music, dance, and traditional rituals.",
    "country": "Mexico",
    "country_rank": 4
  }
]
